author: frack113
custom:
  wazuh_rule_id: 200480
date: 2025-06-04
description: 'Detects the execution of "RegAsm.exe" without a commandline flag or
  file, which might indicate potential process injection activity.

  Usually "RegAsm.exe" should point to a dedicated DLL file or call the help with
  the "/?" flag.

  '
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|endswith:
    - RegAsm
    - RegAsm.exe
    - RegAsm.exe"
    - RegAsm.exe'
  selection_img:
  - Image|endswith: \RegAsm.exe
  - OriginalFileName: RegAsm.exe
falsepositives:
- Legitimate use of Regasm by developers.
id: 651f87f7-12db-47f9-84c5-f27b081b94b6
level: low
logsource:
  category: process_creation
  product: windows
references:
- https://www.mcafee.com/blogs/other-blogs/mcafee-labs/agent-teslas-unique-approach-vbs-and-steganography-for-delivery-and-intrusion/
- https://www.zscaler.fr/blogs/security-research/threat-actors-exploit-cve-2017-11882-deliver-agent-tesla
- https://learn.microsoft.com/en-us/dotnet/framework/tools/regasm-exe-assembly-registration-tool
- https://app.any.run/tasks/ea944b89-69d8-49c8-ac1f-5c76ad300db2
- https://www.joesandbox.com/analysis/1467354/0/html
status: experimental
tags:
- attack.stealth
- attack.t1218.009
title: RegAsm.EXE Execution Without CommandLine Flags or Files
