author: Florian Roth (Nextron Systems), Teymur Kheirkhabarov
custom:
  wazuh_rule_id: 200067
date: 2022-01-28
description: Detects the execution of "whoami.exe" by privileged accounts that are
  often abused by threat actors
detection:
  condition: all of selection_*
  selection_img:
  - OriginalFileName: whoami.exe
  - Image|endswith: \whoami.exe
  selection_user:
    User|contains:
    - AUTHORI
    - AUTORI
    - TrustedInstaller
falsepositives:
- Unknown
id: 79ce34ca-af29-4d0e-b832-fc1b377020db
level: high
logsource:
  category: process_creation
  product: windows
modified: 2023-12-04
references:
- https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
- https://web.archive.org/web/20221019044836/https://nsudo.m2team.org/en-us/
related:
- id: 80167ada-7a12-41ed-b8e9-aa47195c66a1
  type: obsolete
status: test
tags:
- attack.privilege-escalation
- attack.discovery
- attack.t1033
title: Whoami.EXE Execution From Privileged Process
