author: Christian Burkard (Nextron Systems)
custom:
  wazuh_rule_id: 200135
date: 2021-08-23
description: Detects an UAC bypass that uses changepk.exe and slui.exe (UACMe 61)
detection:
  condition: selection
  selection:
    Image|endswith: \changepk.exe
    IntegrityLevel:
    - High
    - System
    - S-1-16-16384
    - S-1-16-12288
    ParentImage|endswith: \slui.exe
falsepositives:
- Unknown
id: 503d581c-7df0-4bbe-b9be-5840c0ecc1fc
level: high
logsource:
  category: process_creation
  product: windows
modified: 2024-12-01
references:
- https://mattharr0ey.medium.com/privilege-escalation-uac-bypass-in-changepk-c40b92818d1b
- https://github.com/hfiref0x/UACME
- https://medium.com/falconforce/falconfriday-detecting-uac-bypasses-0xff16-86c2a9107abf
status: test
tags:
- attack.privilege-escalation
- attack.t1548.002
title: UAC Bypass Using ChangePK and SLUI
