author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
custom:
  wazuh_rule_id: 201146
date: 2022-06-28
description: Detects usage of bitsadmin downloading a file with a suspicious extension
detection:
  condition: all of selection_*
  selection_extension:
    CommandLine|contains:
    - .7z
    - .asax
    - .ashx
    - .asmx
    - .asp
    - .aspx
    - .bat
    - .cfm
    - .cgi
    - .chm
    - .cmd
    - .dll
    - .gif
    - .jpeg
    - .jpg
    - .jsp
    - .jspx
    - .log
    - .png
    - .ps1
    - .psm1
    - .rar
    - .scf
    - .sct
    - .txt
    - .vbe
    - .vbs
    - .war
    - .wsf
    - .wsh
    - .xll
    - .zip
  selection_flags:
    CommandLine|contains:
    - ' /transfer '
    - ' /create '
    - ' /addfile '
  selection_img:
  - Image|endswith: \bitsadmin.exe
  - OriginalFileName: bitsadmin.exe
falsepositives:
- Unknown
id: 5b80a791-ad9b-4b75-bcc1-ad4e1e89c200
level: high
logsource:
  category: process_creation
  product: windows
modified: 2023-05-30
references:
- https://blog.netspi.com/15-ways-to-download-a-file/#bitsadmin
- https://isc.sans.edu/diary/22264
- https://lolbas-project.github.io/lolbas/Binaries/Bitsadmin/
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_bitsadmin_download_susp_extensions/info.yml
simulation:
- atomic_guid: a1921cd3-9a2d-47d5-a891-f1d0f2a7a31b
  name: Windows - BITSAdmin BITS Download
  technique: T1105
  type: atomic-red-team
status: test
tags:
- attack.persistence
- attack.execution
- attack.stealth
- attack.t1197
- attack.s0190
- attack.t1036.003
- attack.command-and-control
- attack.t1105
title: File With Suspicious Extension Downloaded Via Bitsadmin
