author: Florian Roth (Nextron Systems)
custom:
  wazuh_rule_id: 200955
date: 2023-10-11
description: Detects the use of CoercedPotato, a tool for privilege escalation
detection:
  condition: 1 of selection_*
  selection_loader_img:
    Image|endswith: \CoercedPotato.exe
  selection_loader_imphash:
    Hashes|contains:
    - IMPHASH=A75D7669DB6B2E107A44C4057FF7F7D6
    - IMPHASH=F91624350E2C678C5DCBE5E1F24E22C9
    - IMPHASH=14C81850A079A87E83D50CA41C709A15
  selection_params:
    CommandLine|contains: ' --exploitId '
falsepositives:
- Unknown
id: e8d34729-86a4-4140-adfd-0a29c2106307
level: high
logsource:
  category: process_creation
  product: windows
modified: 2024-11-23
references:
- https://github.com/hackvens/CoercedPotato
- https://blog.hackvens.fr/articles/CoercedPotato.html
status: test
tags:
- attack.privilege-escalation
- attack.stealth
- attack.t1055
title: HackTool - CoercedPotato Execution
