author: Michael Haag, Florian Roth (Nextron Systems), juju4, oscd.community, Swachchhanda
  Shrawan Poudel (Nextron Systems)
custom:
  wazuh_rule_id: 200034
date: 2023-02-14
description: 'Detects the execution of WMIC in order to get a list of firewall, antivirus
  and antispywware products.

  Adversaries often enumerate security products installed on a system to identify
  security controls and potential ways to evade detection or disable protection mechanisms.

  This information helps them plan their next attack steps and choose appropriate
  techniques to bypass security measures.

  '
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains:
    - AntiVirusProduct
    - AntiSpywareProduct
    - FirewallProduct
  selection_img:
  - Image|endswith: \wmic.exe
  - OriginalFileName: wmic.exe
falsepositives:
- Legitimate use of wmic.exe for reconnaissance of firewall, antivirus and antispywware
  products.
id: e568650b-5dcd-4658-8f34-ded0b1e13992
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2025-03-17
references:
- https://github.com/albertzsigovits/malware-notes/blob/c820c7fea76cf76a861b28ebc77e06100e20ec29/Ransomware/Maze.md
- https://www.hybrid-analysis.com/sample/4be06ecd234e2110bd615649fe4a6fa95403979acf889d7e45a78985eb50acf9?environmentId=1
- https://www.trendmicro.com/en_us/research/25/c/socgholishs-intrusion-techniques-facilitate-distribution-of-rans.html
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_wmic_recon_product_class/info.yml
status: test
tags:
- attack.execution
- attack.t1047
- attack.discovery
- attack.t1082
title: Potential Product Class Reconnaissance Via Wmic.EXE
