author: Swachchhanda Shrawan Poudel (Nextron Systems)
custom:
  wazuh_rule_id: 200970
date: 2026-02-03
description: 'Detects suspicious child process creation by the Notepad++ updater process
  (gup.exe).

  This could indicate potential exploitation of the updater component to deliver unwanted
  malware.

  '
detection:
  condition: selection_parent and 1 of selection_child_*
  selection_child_cli:
    CommandLine|contains:
    - bitsadmin
    - certutil
    - curl
    - finger
    - forfiles
    - regsvr32
    - rundll32
    - wget
  selection_child_img:
    Image|endswith:
    - \cmd.exe
    - \powershell.exe
    - \pwsh.exe
    - \cscript.exe
    - \wscript.exe
    - \mshta.exe
  selection_parent:
    ParentImage|endswith: \gup.exe
falsepositives:
- Unlikely
id: bb0e87ce-c89f-4857-84fa-095e4483e9cb
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://notepad-plus-plus.org/news/v889-released/
- https://www.heise.de/en/news/Notepad-updater-installed-malware-11109726.html
- https://www.rapid7.com/blog/post/tr-chrysalis-backdoor-dive-into-lotus-blossoms-toolkit/
- https://www.validin.com/blog/exploring_notepad_plus_plus_network_indicators/
- https://securelist.com/notepad-supply-chain-attack/118708/
status: experimental
tags:
- attack.collection
- attack.credential-access
- attack.t1195.002
- attack.initial-access
- attack.t1557
title: Suspicious Child Process of Notepad++ Updater - GUP.Exe
