author: Christian Burkard (Nextron Systems)
custom:
  wazuh_rule_id: 200114
date: 2021-08-23
description: Detects the pattern of UAC Bypass via WSReset usable by default sysmon-config
detection:
  condition: selection
  selection:
    Image|endswith: \wsreset.exe
    IntegrityLevel:
    - High
    - System
    - S-1-16-16384
    - S-1-16-12288
falsepositives:
- Unknown
id: 89a9a0e0-f61a-42e5-8957-b1479565a658
level: high
logsource:
  category: process_creation
  product: windows
modified: 2024-12-01
references:
- https://lolbas-project.github.io/lolbas/Binaries/Wsreset/
- https://github.com/hfiref0x/UACME
- https://medium.com/falconforce/falconfriday-detecting-uac-bypasses-0xff16-86c2a9107abf
status: test
tags:
- attack.privilege-escalation
- attack.t1548.002
title: UAC Bypass WSReset
