author: Chirag Damani (KPMG India), Swachchhanda Shrawan Poudel (Nextron Systems)
custom:
  wazuh_rule_id: 200150
date: 2026-07-01
description: 'Detects the usage of SystemSettingsAdminFlows.exe to disable Windows
  Defender.

  SystemSettingsAdminFlows.exe is a legitimate Windows component used for administrative
  configuration tasks.

  However, attackers may abuse it to disable Windows Defender as part of their attack
  chain, especially in the context of ransomware or other malware campaigns.

  '
detection:
  condition: all of selection_ssaf_* and (all of selection_cli_enable_* or all of
    selection_cli_disable_*)
  selection_cli_disable_opt:
    CommandLine|contains:
    - 'SubmitSamplesConsent '
    - 'SpyNetReporting '
    - 'DisableCDPUserAuthPolicy '
  selection_cli_disable_value:
    CommandLine|contains: '0'
  selection_cli_enable_opt:
    CommandLine|contains:
    - 'RTP '
    - 'RealTimeProtection '
    - 'DisableEnhancedNotifications '
  selection_cli_enable_value:
    CommandLine|contains: '1'
  selection_ssaf_cli:
    CommandLine|contains: defender
  selection_ssaf_img:
  - Image|endswith: \SystemSettingsAdminFlows.exe
  - OriginalFileName: SystemSettingsAdminFlows.EXE
falsepositives:
- Legitimate turn off of Windows Defender by the technical users or administrators
  for troubleshooting or other purposes.
id: da92713f-ca2d-4fab-8320-098013d3f43a
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://thedfirreport.com/2026/02/23/apache-activemq-exploit-leads-to-lockbit-ransomware/
- https://www.huntress.com/blog/lolbin-to-inc-ransomware
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_lolbin_systemsettingsadminflows_defender_disable/info.yml
status: experimental
tags:
- attack.defense-impairment
- attack.t1685
title: Windows Defender Disabled Via SystemSettingsAdminFlows.EXE
