author: Florian Roth (Nextron Systems)
custom:
  wazuh_rule_id: 200043
date: 2021-06-25
description: 'Detects the attempt to create an ActiveScriptEventConsumer via WMIC.EXE.

  An ActiveScriptEventConsumer is a built-in Windows Management Instrumentation (WMI)
  class that

  automatically executes a predefined script (in VBScript or JScript) whenever a specific
  system event occurs.

  Adversaries often abuse ActiveScriptEventConsumer to maintain persistence on a compromised
  host by executing a malicious script whenever a specific event occurs.

  '
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains|all:
    - ActiveScriptEventConsumer
    - ' CREATE '
  selection_img:
  - OriginalFileName: wmic.exe
  - Image|endswith: \WMIC.exe
falsepositives:
- Legitimate software creating script event consumers
id: ebef4391-1a81-4761-a40a-1db446c0e625
level: high
logsource:
  category: process_creation
  product: windows
modified: 2026-06-19
references:
- https://twitter.com/johnlatwc/status/1408062131321270282?s=12
- https://www.fireeye.com/content/dam/fireeye-www/global/en/current-threats/pdfs/wp-windows-management-instrumentation.pdf
status: test
tags:
- attack.privilege-escalation
- attack.persistence
- attack.t1546.003
title: NewActiveScriptEventConsumer Creation Attempt via Wmic.EXE
