author: Matt Anderson (Huntress)
custom:
  wazuh_rule_id: 201075
date: 2024-07-23
description: 'Detects the use of powershell commands from headless ConHost window.

  The "--headless" flag hides the windows from the user upon execution.

  '
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains|all:
    - --headless
    - powershell
  selection_img:
  - Image|endswith: \conhost.exe
  - OriginalFileName: CONHOST.EXE
falsepositives:
- Unknown
id: 056c7317-9a09-4bd4-9067-d051312752ea
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://www.huntress.com/blog/fake-browser-updates-lead-to-boinc-volunteer-computing-software
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_conhost_headless_powershell/info.yml
related:
- id: 00ca75ab-d5ce-43be-b86c-55ff39c6abfc
  type: derived
status: test
tags:
- attack.execution
- attack.stealth
- attack.t1059.001
- attack.t1059.003
- attack.t1564.003
title: Powershell Executed From Headless ConHost Process
