author: Daniel Koifman (KoifSec)
custom:
  wazuh_rule_id: 200024
date: 2025-07-30
description: 'Detects the usage of wmic.exe to modify Windows registry via the WMI
  StdRegProv class write methods (CreateKey, DeleteKey, SetStringValue, etc.).

  This behaviour could be potentially suspicious because it uses an alternative method
  to modify registry keys instead of legitimate registry tools like reg.exe or regedit.exe.

  Attackers specifically choose this technique to evade detection and bypass security
  monitoring focused on traditional registry modification commands.

  '
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains:
    - CreateKey
    - DeleteKey
    - DeleteValue
    - SetBinaryValue
    - SetDWORDValue
    - SetExpandedStringValue
    - SetMultiStringValue
    - SetQWORDValue
    - SetSecurityDescriptor
    - SetStringValue
    CommandLine|contains|all:
    - stdregprov
    - call
  selection_img:
  - Image|endswith: \wmic.exe
  - OriginalFileName: wmic.exe
falsepositives:
- Legitimate administrative activity
id: c453ab7a-1f5c-4716-a3b4-dea8135fb43a
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2026-06-19
references:
- https://www.bitdefender.com/en-us/blog/businessinsights/shrinklocker-decryptor-from-friend-to-foe-and-back-again
- https://trustedsec.com/blog/command-line-underdog-wmic-in-action
- https://trustedsec.com/blog/wmi-for-script-kiddies
- https://learn.microsoft.com/en-us/previous-versions/windows/desktop/regprov/stdregprov
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_wmic_stdregprov_reg_modification/info.yml
related:
- id: a0e417e2-2fa1-40da-b6d2-e094cd5e1191
  type: similar
status: experimental
tags:
- attack.execution
- attack.t1047
- attack.persistence
- attack.defense-impairment
- attack.t1112
title: Registry Manipulation via WMI Stdregprov
