author: Ahmed Nosir (@egycondor)
custom:
  wazuh_rule_id: 200428
date: 2025-05-29
description: 'Detects TacticalRMM agent installations where the --api, --auth, and
  related flags are used on the command line.

  These parameters configure the agent to connect to a specific RMM server with authentication,
  client ID, and site ID.

  This technique could indicate a threat actor attempting to register the agent with
  an attacker-controlled RMM infrastructure silently.

  '
detection:
  condition: selection
  selection:
    CommandLine|contains|all:
    - --api
    - --auth
    - --client-id
    - --site-id
    - --agent-type
    Image|contains: \TacticalAgent\tacticalrmm.exe
falsepositives:
- Legitimate system administrator deploying TacticalRMM
id: 2db93a3f-3249-4f73-9e68-0e77a0f8ae7e
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/amidaware/tacticalrmm
- https://apophis133.medium.com/powershell-script-tactical-rmm-installation-45afb639eff3
status: experimental
tags:
- attack.command-and-control
- attack.t1219
- attack.t1105
title: Remote Access Tool - TacticalRMM Agent Registration to Potentially Attacker-Controlled
  Server
