author: Nasreddine Bencherchali (Nextron Systems)
custom:
  wazuh_rule_id: 200170
date: 2023-05-16
description: Detects execution of LiveKD with the "-m" flag to potentially dump the
  kernel memory
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains|windash: ' -m'
  selection_img:
  - Image|endswith:
    - \livekd.exe
    - \livekd64.exe
  - OriginalFileName: livekd.exe
falsepositives:
- Unlikely in production environment
id: c7746f1c-47d3-43d6-8c45-cd1e54b6b0a2
level: high
logsource:
  category: process_creation
  product: windows
modified: 2024-03-13
references:
- https://learn.microsoft.com/en-us/sysinternals/downloads/livekd
- https://4sysops.com/archives/creating-a-complete-memory-dump-without-a-blue-screen/
- https://kb.acronis.com/content/60892
status: test
tags:
- attack.stealth
title: Kernel Memory Dump Via LiveKD
