author: Christian Burkard (Nextron Systems)
custom:
  wazuh_rule_id: 200120
date: 2021-08-23
description: Detects the pattern of UAC Bypass using pkgmgr.exe and dism.exe (UACMe
  23)
detection:
  condition: selection
  selection:
    Image|endswith: \dism.exe
    IntegrityLevel:
    - High
    - System
    - S-1-16-16384
    - S-1-16-12288
    ParentImage|endswith: \pkgmgr.exe
falsepositives:
- Unknown
id: a743ceba-c771-4d75-97eb-8a90f7f4844c
level: high
logsource:
  category: process_creation
  product: windows
modified: 2024-12-01
references:
- https://github.com/hfiref0x/UACME
status: test
tags:
- attack.privilege-escalation
- attack.t1548.002
title: UAC Bypass Using PkgMgr and DISM
