author: frack113
custom:
  wazuh_rule_id: 201047
date: 2022-12-31
description: Detects uncommon child processes of "DefaultPack.EXE" binary as a proxy
  to launch other programs
detection:
  condition: selection
  selection:
    ParentImage|endswith: \DefaultPack.exe
falsepositives:
- Unknown
id: b2309017-4235-44fe-b5af-b15363011957
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2024-04-22
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/DefaultPack/
- https://www.echotrail.io/insights/search/defaultpack.exe
status: test
tags:
- attack.stealth
- attack.t1218
- attack.execution
title: Uncommon Child Process Of Defaultpack.EXE
