author: Christian Burkard (Nextron Systems)
custom:
  wazuh_rule_id: 200134
date: 2021-08-30
description: Detects the pattern of UAC Bypass using scheduled tasks and variable
  expansion of cleanmgr.exe (UACMe 34)
detection:
  condition: selection
  selection:
    CommandLine|endswith: '"\system32\cleanmgr.exe /autoclean /d C:'
    IntegrityLevel:
    - High
    - System
    - S-1-16-16384
    - S-1-16-12288
    ParentCommandLine: C:\Windows\system32\svchost.exe -k netsvcs -p -s Schedule
falsepositives:
- Unknown
id: b697e69c-746f-4a86-9f59-7bfff8eab881
level: high
logsource:
  category: process_creation
  product: windows
modified: 2024-12-01
references:
- https://github.com/hfiref0x/UACME
status: test
tags:
- attack.privilege-escalation
- attack.t1548.002
title: UAC Bypass Using Disk Cleanup
