author: Marco Pedrinazzi (@pedrinazziM) (InTheCyber)
custom:
  wazuh_rule_id: 200485
date: 2026-01-09
description: 'Detects the usage of Reg.Exe to query system language settings.

  Attackers may discover the system language to determine the geographic location
  of victims, customize payloads for specific regions,

  or avoid targeting certain locales to evade detection.

  '
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains|all:
    - query
    - Control\Nls\Language
  selection_img:
  - Image|endswith: \reg.exe
  - OriginalFileName: reg.exe
falsepositives:
- Unknown
id: c43a5405-e8e1-4221-9ac9-dbe3fa14e886
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://scythe.io/threat-thursday/threatthursday-darkside-ransomware
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_reg_system_language_discovery/info.yml
simulation:
- atomic_guid: 631d4cf1-42c9-4209-8fe9-6bd4de9421be
  name: Discover System Language by Registry Query
  technique: T1614.001
  type: atomic-red-team
status: experimental
tags:
- attack.discovery
- attack.t1614.001
title: System Language Discovery via Reg.Exe
