author: Liran Ravich
custom:
  wazuh_rule_id: 200177
date: 2025-11-14
description: 'Detects instances of svchost.exe running with an unusual or uncommon
  command line parameter by excluding known legitimate or common patterns.

  This could point at a file masquerading as svchost, a process injection, or hollowing
  of a legitimate svchost instance.

  '
detection:
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
  filter_main_empty:
    CommandLine: ''
  filter_main_flags:
    CommandLine|re: -k\s\w{1,64}(?:\s?(?:-p|-s))?
  filter_main_null:
    CommandLine: null
  filter_optional_defender:
    CommandLine|contains: svchost.exe
    ParentImage|endswith: \MsMpEng.exe
  filter_optional_mrt:
    CommandLine: svchost.exe
    ParentImage|endswith: \MRT.exe
  selection:
    Image|endswith: \svchost.exe
falsepositives:
- Unlikely
id: f17211f1-1f24-4d0c-829f-31e28dc93cdd
level: high
logsource:
  category: process_creation
  product: windows
modified: 2026-03-23
references:
- https://cardinalops.com/blog/the-art-of-anomaly-hunting-patterns-detection/
- https://www.security.com/threat-intelligence/blackbyte-exbyte-ransomware
- https://cloud.google.com/blog/topics/threat-intelligence/apt41-initiates-global-intrusion-campaign-using-multiple-exploits/
- https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2018/03/08064518/Carbanak_APT_eng.pdf
status: experimental
tags:
- attack.privilege-escalation
- attack.stealth
- attack.t1036.005
- attack.t1055
- attack.t1055.012
title: Uncommon Svchost Command Line Parameter
