author: '@gott_cyber, Nasreddine Bencherchali (Nextron Systems)'
custom:
  wazuh_rule_id: 200313
date: 2022-12-11
description: 'Detects uncommon child process of Setres.EXE.

  Setres.EXE is a Windows server only process and tool that can be used to set the
  screen resolution.

  It can potentially be abused in order to launch any arbitrary file with a name containing
  the word "choice" from the current execution path.

  '
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_legit_location:
    Image|endswith:
    - C:\Windows\System32\choice.exe
    - C:\Windows\SysWOW64\choice.exe
  selection:
    Image|contains: \choice
    ParentImage|endswith: \setres.exe
falsepositives:
- Unlikely
id: 835e75bf-4bfd-47a4-b8a6-b766cac8bcb7
level: high
logsource:
  category: process_creation
  product: windows
modified: 2024-06-26
references:
- https://lolbas-project.github.io/lolbas/Binaries/Setres/
- https://twitter.com/0gtweet/status/1583356502340870144
- https://strontic.github.io/xcyclopedia/library/setres.exe-0E30E4C09637D7A128A37B59A3BC4D09.html
- https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc731033(v=ws.11)
status: test
tags:
- attack.stealth
- attack.t1218
- attack.t1202
title: Uncommon Child Process Of Setres.EXE
