author: Nasreddine Bencherchali (Nextron Systems)
custom:
  wazuh_rule_id: 200363
date: 2022-08-10
description: Detects rundll32 execution where the DLL is located on a remote location
  (share)
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains: ' \\\\'
  selection_img:
  - Image|endswith: \rundll32.exe
  - OriginalFileName: RUNDLL32.EXE
  - CommandLine|contains: rundll32
falsepositives:
- Unlikely
id: 5cdb711b-5740-4fb2-ba88-f7945027afac
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://www.cybereason.com/blog/rundll32-the-infamous-proxy-for-executing-malicious-code
status: test
tags:
- attack.execution
- attack.lateral-movement
- attack.stealth
- attack.t1021.002
- attack.t1218.011
title: Rundll32 UNC Path Execution
