author: Nasreddine Bencherchali (Nextron Systems)
custom:
  wazuh_rule_id: 201143
date: 2022-12-23
description: Detects chromium based browsers starting in headless and debugging mode
  and pointing to a user profile. This could be a sign of data stealing or remote
  control
detection:
  condition: selection
  selection:
    CommandLine|contains|all:
    - --remote-debugging-
    - --user-data-dir
    - --headless
falsepositives:
- Unknown
id: 3e8207c5-fcd2-4ea6-9418-15d45b4890e4
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/defaultnamehere/cookie_crimes/
- https://mango.pdf.zone/stealing-chrome-cookies-without-a-password
- https://embracethered.com/blog/posts/2020/cookie-crimes-on-mirosoft-edge/
- https://embracethered.com/blog/posts/2020/chrome-spy-remote-control/
related:
- id: b3d34dc5-2efd-4ae3-845f-8ec14921f449
  type: derived
status: test
tags:
- attack.credential-access
- attack.collection
- attack.stealth
- attack.t1185
- attack.t1564.003
title: Potential Data Stealing Via Chromium Headless Debugging
