author: TropChaud
custom:
  wazuh_rule_id: 200782
date: 2025-11-22
description: 'Detects the use of the Group Policy Management Editor (GPME) to modify
  Default Domain or Default Domain Controllers Group Policy Objects (GPOs).

  Adversaries may leverage GPME to make stealthy changes in these default GPOs to
  deploy malicious GPOs configurations across the domain without raising suspicion.

  '
detection:
  condition: all of selection_*
  selection_default_gpos:
    CommandLine|contains:
    - 31B2F340-016D-11D2-945F-00C04FB984F9
    - 6AC1786C-016F-11D2-945F-00C04FB984F9
  selection_gpme:
    CommandLine|contains|all:
    - gpme.msc
    - 'gpobject:'
  selection_mmc:
  - Image|endswith: \mmc.exe
  - OriginalFileName: MMC.exe
falsepositives:
- Legitimate use of GPME to modify GPOs
id: dcff7e85-d01f-4eb5-badd-84e2e6be8294
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://www.trendmicro.com/en_us/research/25/i/unmasking-the-gentlemen-ransomware.html
- https://adsecurity.org/?p=3377
- https://sdmsoftware.com/general-stuff/launching-the-new-gp-management-editor-from-the-command-line/
- https://www.pentestpartners.com/security-blog/living-off-the-land-gpo-style/
related:
- id: e5ac86dd-2da1-454b-be74-05d26c769d7d
  type: similar
status: experimental
tags:
- attack.privilege-escalation
- attack.defense-impairment
- attack.t1484.001
title: Windows Default Domain GPO Modification via GPME
