author: Nikita Nazarov, oscd.community
custom:
  wazuh_rule_id: 200923
date: 2020-10-12
description: Detects Obfuscated Powershell via Stdin in Scripts
detection:
  condition: selection
  selection:
    CommandLine|re: (?i)(?:set).*&&\s?set.*(?:environment|invoke|\$\{?input).*&&.*"
falsepositives:
- Unknown
id: 9c14c9fa-1a63-4a64-8e57-d19280559490
level: high
logsource:
  category: process_creation
  product: windows
modified: 2026-03-16
references:
- https://github.com/SigmaHQ/sigma/issues/1009
status: test
tags:
- attack.stealth
- attack.t1027
- attack.execution
- attack.t1059.001
title: Invoke-Obfuscation Via Stdin
