author: Swachchhanda Shrawan Poudel (Nextron Systems)
custom:
  wazuh_rule_id: 200008
date: 2025-10-10
description: Detects the use of Kali Linux through Windows Subsystem for Linux
detection:
  condition: 1 of selection_img_* or all of selection_kali_* and not 1 of filter_main_*
  filter_main_install_uninstall:
    CommandLine|contains:
    - ' -i '
    - ' --install '
    - ' --unregister '
  selection_img_appdata:
  - Image|contains|all:
    - :\Users\
    - \AppData\Local\packages\KaliLinux
  - Image|contains|all:
    - :\Users\
    - \AppData\Local\Microsoft\WindowsApps\kali.exe
  selection_img_windowsapps:
    Image|contains: :\Program Files\WindowsApps\KaliLinux.
    Image|endswith: \kali.exe
  selection_kali_wsl_child:
  - Image|contains:
    - \kali.exe
    - \KaliLinux
  - CommandLine|contains:
    - Kali.exe
    - Kali-linux
    - kalilinux
  selection_kali_wsl_parent:
    ParentImage|endswith:
    - \wsl.exe
    - \wslhost.exe
falsepositives:
- Legitimate installation or usage of Kali Linux WSL by administrators or security
  teams
id: 6f1a11aa-4b8a-4b7f-9e13-4d3e4ff0e0d4
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://medium.com/@redfanatic7/running-kali-linux-on-windows-51ad95166e6e
- https://learn.microsoft.com/en-us/windows/wsl/install
status: experimental
tags:
- attack.stealth
- attack.t1202
title: WSL Kali-Linux Usage
