author: montysecurity, Swachchhanda Shrawan Poudel (Nextron Systems)
custom:
  wazuh_rule_id: 200274
date: 2025-11-19
description: "Detects suspicious execution patterns where users are tricked into running\
  \ malicious commands via clipboard manipulation, either through the Windows Run\
  \ dialog (ClickFix) or File Explorer address bar (FileFix).\nAttackers leverage\
  \ social engineering campaigns\u2014such as fake CAPTCHA challenges or urgent alerts\u2014\
  encouraging victims to paste clipboard contents, often executing mshta.exe, powershell.exe,\
  \ or similar commands to infect systems.\n"
detection:
  condition: all of selection_*
  selection_cli_captcha:
    CommandLine|contains:
    - account
    - anti-bot
    - botcheck
    - captcha
    - challenge
    - confirmation
    - fraud
    - human
    - identification
    - identificator
    - identity
    - robot
    - validation
    - verification
    - verify
  selection_parent:
    CommandLine|contains: '#'
    ParentImage|endswith: \explorer.exe
falsepositives:
- Unlikely
id: d487ed4a-fd24-436d-a0b2-f4e95f7b2635
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/JohnHammond/recaptcha-phish
- https://www.zscaler.com/blogs/security-research/deepseek-lure-using-captchas-spread-malware
- https://www.threatdown.com/blog/clipboard-hijacker-tries-to-install-a-trojan/
- https://app.any.run/tasks/5c16b4db-4b36-4039-a0ed-9b09abff8be2
- https://www.esentire.com/security-advisories/netsupport-rat-clickfix-distribution
- https://www.scpx.com.au/2025/11/16/decades-old-finger-protocol-abused-in-clickfix-malware-attacks/
related:
- id: f5fe36cf-f1ec-4c23-903d-09a3110f6bbb
  type: similar
status: experimental
tags:
- attack.execution
- attack.t1204.001
- attack.t1204.004
title: Suspicious ClickFix/FileFix Execution Pattern
