author: Florian Roth (Nextron Systems), oscd.community
custom:
  wazuh_rule_id: 200714
date: 2019-01-29
description: Detects the execution of netsh to configure a port forwarding of port
  3389 (RDP) rule
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains|all:
    - ' i'
    - ' p'
    - =3389
    - ' c'
  selection_img:
  - Image|endswith: \netsh.exe
  - OriginalFileName: netsh.exe
falsepositives:
- Legitimate administration activity
id: 782d6f3e-4c5d-4b8c-92a3-1d05fed72e63
level: high
logsource:
  category: process_creation
  product: windows
modified: 2023-02-13
references:
- https://www.fireeye.com/blog/threat-research/2019/01/bypassing-network-restrictions-through-rdp-tunneling.html
status: test
tags:
- attack.lateral-movement
- attack.command-and-control
- attack.t1090
title: RDP Port Forwarding Rule Added Via Netsh.EXE
