author: Luca Di Bartolomeo (CrimpSec)
custom:
  wazuh_rule_id: 200890
date: 2024-01-29
description: 'Detects the execution of SharpMove, a .NET utility performing multiple
  tasks such as "Task Creation", "SCM" query, VBScript execution using WMI via its
  PE metadata and command line options.

  '
detection:
  condition: selection_img or all of selection_cli_*
  selection_cli_actions:
    CommandLine|contains:
    - action=create
    - action=dcom
    - action=executevbs
    - action=hijackdcom
    - action=modschtask
    - action=modsvc
    - action=query
    - action=scm
    - action=startservice
    - action=taskscheduler
  selection_cli_computer:
    CommandLine|contains: computername=
  selection_img:
  - Image|endswith: \SharpMove.exe
  - OriginalFileName: SharpMove.exe
falsepositives:
- Unknown
id: 055fb54c-a8f4-4aee-bd44-f74cf30a0d9d
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/0xthirteen/SharpMove/
- https://pentestlab.blog/tag/sharpmove/
status: test
tags:
- attack.lateral-movement
- attack.t1021.002
title: HackTool - SharpMove Tool Execution
