author: Florian Roth (Nextron Systems), Jonhnathan Ribeiro, oscd.community
custom:
  wazuh_rule_id: 201115
date: 2019-10-14
description: Detects a code page switch in command line or batch scripts to a rare
  language
detection:
  condition: selection
  selection:
    CommandLine|endswith:
    - ' 936'
    - ' 1258'
    Image|endswith: \chcp.com
falsepositives:
- Administrative activity (adjust code pages according to your organization's region)
id: c7942406-33dd-4377-a564-0f62db0593a3
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2023-03-07
references:
- https://learn.microsoft.com/en-us/windows/win32/intl/code-page-identifiers
- https://twitter.com/cglyer/status/1183756892952248325
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_chcp_codepage_switch/info.yml
status: test
tags:
- attack.stealth
- attack.t1036
title: Suspicious CodePage Switch Via CHCP
