author: Cedric MAURUGEON, Florian Roth (Nextron Systems), Swachchhanda Shrawan Poudel,
  Nasreddine Bencherchali (Nextron Systems)
custom:
  wazuh_rule_id: 200513
date: 2021-09-24
description: Detects the use of the Microsoft Windows Resource Leak Diagnostic tool
  "rdrleakdiag.exe" to dump process memory
detection:
  condition: all of selection_*
  selection_cli_dump:
    CommandLine|contains|windash:
    - /memdmp
    - fullmemdmp
  selection_cli_output_process:
    CommandLine|contains|windash:
    - ' /o '
    - ' /p '
  selection_img:
  - Image|endswith: \rdrleakdiag.exe
  - OriginalFileName: RdrLeakDiag.exe
falsepositives:
- Unlikely
id: edadb1e5-5919-4e4c-8462-a9e643b02c4b
level: high
logsource:
  category: process_creation
  product: windows
modified: 2024-08-15
references:
- https://www.pureid.io/dumping-abusing-windows-credentials-part-1/
- https://www.crowdstrike.com/blog/overwatch-exposes-aquatic-panda-in-possession-of-log-4-shell-exploit-tools/
- https://lolbas-project.github.io/lolbas/Binaries/Rdrleakdiag/
- https://twitter.com/0gtweet/status/1299071304805560321?s=21
- https://news.sophos.com/en-us/2024/06/05/operation-crimson-palace-a-technical-deep-dive
related:
- id: 6355a919-2e97-4285-a673-74645566340d
  type: obsolete
status: test
tags:
- attack.credential-access
- attack.t1003.001
title: Process Memory Dump via RdrLeakDiag.EXE
