author: frack113
custom:
  wazuh_rule_id: 200774
date: 2021-07-07
description: Adversaries may disable security tools to avoid possible detection of
  their tools and activities by removing Windows Defender Definition Files
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains|all:
    - ' -RemoveDefinitions'
    - ' -All'
  selection_img:
  - Image|endswith: \MpCmdRun.exe
  - OriginalFileName: MpCmdRun.exe
falsepositives:
- Unknown
id: 9719a8aa-401c-41af-8108-ced7ec9cd75c
level: high
logsource:
  category: process_creation
  product: windows
modified: 2023-07-18
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
- https://unit42.paloaltonetworks.com/unit42-gorgon-group-slithering-nation-state-cybercrime/
status: test
tags:
- attack.defense-impairment
- attack.t1685
title: Windows Defender Definition Files Removed
