author: Muhammad Faisal (@faisalusuf)
custom:
  wazuh_rule_id: 200519
date: 2024-12-19
description: 'Detects the execution of Microsoft Quick Assist tool "QuickAssist.exe".
  This utility can be used by attackers to gain remote access.

  '
detection:
  condition: selection
  selection:
    Image|endswith: \QuickAssist.exe
falsepositives:
- Legitimate use of Quick Assist in the environment.
id: e20b5b14-ce93-4230-88af-981983ef6e74
level: low
logsource:
  category: process_creation
  product: windows
references:
- https://www.microsoft.com/en-us/security/blog/2024/05/15/threat-actors-misusing-quick-assist-in-social-engineering-attacks-leading-to-ransomware/
- https://www.linkedin.com/posts/kevin-beaumont-security_ive-been-assisting-a-few-orgs-hit-with-successful-activity-7268055739116445701-xxjZ/
- https://x.com/cyb3rops/status/1862406110365245506
- https://learn.microsoft.com/en-us/windows/client-management/client-tools/quick-assist
status: experimental
tags:
- attack.command-and-control
- attack.t1219.002
title: QuickAssist Execution
