author: "J\xE1n Tren\u010Dansk\xFD"
custom:
  wazuh_rule_id: 200444
date: 2021-08-06
description: Detects AnyDesk Remote Desktop silent installation. Which can be used
  by attackers to gain remote access.
detection:
  condition: selection
  selection:
    CommandLine|contains|all:
    - --install
    - --start-with-win
    - --silent
falsepositives:
- Legitimate deployment of AnyDesk
id: 114e7f1c-f137-48c8-8f54-3088c24ce4b9
level: high
logsource:
  category: process_creation
  product: windows
modified: 2023-03-05
references:
- https://twitter.com/TheDFIRReport/status/1423361119926816776?s=20
- https://support.anydesk.com/Automatic_Deployment
status: test
tags:
- attack.command-and-control
- attack.t1219.002
title: Remote Access Tool - AnyDesk Silent Installation
