author: Nasreddine Bencherchali (Nextron Systems)
custom:
  wazuh_rule_id: 200124
date: 2022-07-03
description: Detects the "IDiagnosticProfileUAC" UAC bypass technique
detection:
  condition: selection
  selection:
    IntegrityLevel:
    - High
    - System
    - S-1-16-16384
    - S-1-16-12288
    ParentCommandLine|contains: ' /Processid:{12C21EA7-2EB8-4B55-9249-AC243DA8C666}'
    ParentImage|endswith: \DllHost.exe
falsepositives:
- Unknown
id: 4cbef972-f347-4170-b62a-8253f6168e6d
level: high
logsource:
  category: process_creation
  product: windows
modified: 2024-12-01
references:
- https://github.com/Wh04m1001/IDiagnosticProfileUAC
status: test
tags:
- attack.execution
- attack.privilege-escalation
- attack.t1548.002
title: UAC Bypass Using IDiagnostic Profile
