author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
custom:
  wazuh_rule_id: 200395
date: 2019-11-18
description: 'Detects the execution of a renamed ProcDump executable.

  This often done by attackers or malware in order to evade defensive mechanisms.

  '
detection:
  condition: (selection_ofn or all of selection_cli_*) and not 1 of filter_main_*
  filter_main_known_names:
    Image|endswith:
    - \procdump.exe
    - \procdump64.exe
    - \procdump64a.exe
  selection_cli_dump_flag:
    CommandLine|contains|windash:
    - ' -ma '
    - ' -mp '
  selection_cli_eula_flag:
    CommandLine|contains|windash: ' /accepteula'
  selection_ofn:
    OriginalFileName: procdump
falsepositives:
- Procdump illegally bundled with legitimate software.
- Administrators who rename binaries (should be investigated).
id: 4a0b2c7e-7cb2-495d-8b63-5f268e7bfd67
level: high
logsource:
  category: process_creation
  product: windows
modified: 2026-06-29
references:
- https://learn.microsoft.com/en-us/sysinternals/downloads/procdump
related:
- id: 03795938-1387-481b-9f4c-3f6241e604fe
  type: obsolete
status: test
tags:
- attack.stealth
- attack.t1036.003
title: Renamed ProcDump Execution
