author: Kirill Kiryanov, oscd.community
custom:
  wazuh_rule_id: 200798
date: 2020-10-08
description: Detects process dump via legitimate sqldumper.exe binary
detection:
  condition: selection
  selection:
    CommandLine|contains:
    - '0x0110'
    - 0x01100:40
    Image|endswith: \sqldumper.exe
falsepositives:
- Legitimate MSSQL Server actions
id: 23ceaf5c-b6f1-4a32-8559-f2ff734be516
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021-11-27
references:
- https://twitter.com/countuponsec/status/910977826853068800
- https://twitter.com/countuponsec/status/910969424215232518
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Sqldumper/
status: test
tags:
- attack.credential-access
- attack.t1003.001
title: Dumping Process via Sqldumper.exe
