author: Nasreddine Bencherchali (Nextron Systems)
custom:
  wazuh_rule_id: 200037
date: 2022-06-20
description: Detects the execution of wmic with the "qfe" flag in order to obtain
  information about installed hotfix updates on the system. This is often used by
  pentester and attacker enumeration scripts
detection:
  condition: all of selection*
  selection_cli:
    CommandLine|contains: ' qfe'
  selection_img:
  - OriginalFileName: wmic.exe
  - Image|endswith: \WMIC.exe
falsepositives:
- Unknown
id: dfd2fcb7-8bd5-4daa-b132-5adb61d6ad45
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2023-02-14
references:
- https://github.com/carlospolop/PEASS-ng/blob/fa0f2e17fbc1d86f1fd66338a40e665e7182501d/winPEAS/winPEASbat/winPEAS.bat
- https://sushant747.gitbooks.io/total-oscp-guide/content/privilege_escalation_windows.html
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_wmic_recon_hotfix/info.yml
simulation:
- atomic_guid: 718aebaa-d0e0-471a-8241-c5afa69c7414
  name: WMI Reconnaissance Software
  technique: T1047
  type: atomic-red-team
status: test
tags:
- attack.execution
- attack.t1047
title: Windows Hotfix Updates Reconnaissance Via Wmic.EXE
