author: Florian Roth (Nextron Systems)
custom:
  wazuh_rule_id: 200949
date: 2019-12-22
description: Detects the use of CreateMiniDump hack tool used to dump the LSASS process
  memory for credential extraction on the attacker's machine
detection:
  condition: selection
  selection:
  - Image|endswith: \CreateMiniDump.exe
  - Hashes|contains: IMPHASH=4a07f944a83e8a7c2525efa35dd30e2f
falsepositives:
- Unknown
id: 36d88494-1d43-4dc0-b3fa-35c8fea0ca9d
level: high
logsource:
  category: process_creation
  product: windows
modified: 2024-11-23
references:
- https://ired.team/offensive-security/credential-access-and-credential-dumping/dumping-lsass-passwords-without-mimikatz-minidumpwritedump-av-signature-bypass
status: test
tags:
- attack.credential-access
- attack.t1003.001
title: HackTool - CreateMiniDump Execution
