author: Teymur Kheirkhabarov
custom:
  wazuh_rule_id: 200356
date: 2019-10-26
description: Detection of sc.exe utility spawning by user with Medium integrity level
  to change service ImagePath or FailureCommand
detection:
  condition: scbynonadmin and 1 of selection_*
  scbynonadmin:
    Image|endswith: \sc.exe
    IntegrityLevel:
    - Medium
    - S-1-16-8192
  selection_binpath:
    CommandLine|contains|all:
    - config
    - binPath
  selection_failure:
    CommandLine|contains|all:
    - failure
    - command
falsepositives:
- Unknown
id: d937b75f-a665-4480-88a5-2f20e9f9b22a
level: high
logsource:
  category: process_creation
  product: windows
modified: 2024-12-01
references:
- https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
- https://pentestlab.blog/2017/03/30/weak-service-permissions/
status: test
tags:
- attack.persistence
- attack.privilege-escalation
- attack.execution
- attack.stealth
- attack.t1574.011
title: Possible Privilege Escalation via Weak Service Permissions
