author: '@Kostastsale'
custom:
  wazuh_rule_id: 200463
date: 2023-08-22
description: 'Detects changes to the registry value "PythonFunctionWarnings" that
  would prevent any warnings or alerts from showing when Python functions are about
  to be executed.

  Threat actors could run malicious code through the new Microsoft Excel feature that
  allows Python to run within the spreadsheet.

  '
detection:
  condition: selection
  selection:
    CommandLine|contains: ' 0'
    CommandLine|contains|all:
    - \Microsoft\Office\
    - \Excel\Security
    - PythonFunctionWarnings
falsepositives:
- Unknown
id: 023c654f-8f16-44d9-bb2b-00ff36a62af9
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://support.microsoft.com/en-us/office/data-security-and-python-in-excel-33cc88a4-4a87-485e-9ff9-f35958278327
related:
- id: 17e53739-a1fc-4a62-b1b9-87711c2d5e44
  type: similar
status: test
tags:
- attack.defense-impairment
- attack.t1685
title: Python Function Execution Security Warning Disabled In Excel
