author: Florian Roth (Nextron Systems)
custom:
  wazuh_rule_id: 200948
date: 2021-12-07
description: Detects the use of the Dinject PowerShell cradle based on the specific
  flags
detection:
  condition: selection
  selection:
    CommandLine|contains|all:
    - ' /am51'
    - ' /password'
falsepositives:
- Unlikely
id: d78b5d61-187d-44b6-bf02-93486a80de5a
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2023-02-04
references:
- https://web.archive.org/web/20211001064856/https://github.com/snovvcrash/DInjector
status: test
tags:
- attack.privilege-escalation
- attack.stealth
- attack.t1055
title: HackTool - DInjector PowerShell Cradle Execution
