author: Nasreddine Bencherchali (Nextron Systems)
custom:
  wazuh_rule_id: 200916
date: 2024-06-27
description: 'Detects the use of RemoteKrbRelay, a Kerberos relaying tool via CommandLine
  flags and PE metadata.

  '
detection:
  condition: selection_img or selection_cli_required or all of selection_cli_attack_rbcd_*
    or selection_cli_attack_changepass or selection_cli_attack_addgrpname or selection_cli_attack_smb
  selection_cli_attack_addgrpname:
    CommandLine|contains|all:
    - '-addgroupmember '
    - '-group '
    - '-groupuser '
  selection_cli_attack_changepass:
    CommandLine|contains: '-chp '
    CommandLine|contains|all:
    - '-chpPass '
    - '-chpUser '
  selection_cli_attack_rbcd_main:
    CommandLine|contains: '-rbcd '
  selection_cli_attack_rbcd_options:
    CommandLine|contains:
    - '-cn '
    - '--computername '
  selection_cli_attack_smb:
    CommandLine|contains:
    - interactive
    - secrets
    - service-add
    CommandLine|contains|all:
    - '-smb '
    - '--smbkeyword '
  selection_cli_required:
    CommandLine|contains|all:
    - ' -clsid '
    - ' -target '
    - ' -victim '
  selection_img:
  - Image|endswith: \RemoteKrbRelay.exe
  - OriginalFileName: RemoteKrbRelay.exe
falsepositives:
- Unlikely
id: a7664b14-75fb-4a50-a223-cb9bc0afbacf
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/CICADA8-Research/RemoteKrbRelay
status: test
tags:
- attack.credential-access
- attack.t1558.003
title: HackTool - RemoteKrbRelay Execution
