author: frack113
custom:
  wazuh_rule_id: 200042
date: 2022-12-11
description: Detects potential tampering with Windows Defender settings such as adding
  exclusion using wmic
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains: /Namespace:\\\\root\\Microsoft\\Windows\\Defender
  selection_img:
  - OriginalFileName: wmic.exe
  - Image|endswith: \WMIC.exe
falsepositives:
- Unknown
id: 51cbac1e-eee3-4a90-b1b7-358efb81fa0a
level: high
logsource:
  category: process_creation
  product: windows
modified: 2023-02-14
references:
- https://github.com/redcanaryco/atomic-red-team/blob/5c1e6f1b4fafd01c8d1ece85f510160fc1275fbf/atomics/T1562.001/T1562.001.md
- https://www.bleepingcomputer.com/news/security/gootkit-malware-bypasses-windows-defender-by-setting-path-exclusions/
- https://www.bleepingcomputer.com/news/security/iobit-forums-hacked-to-spread-ransomware-to-its-members/
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_wmic_namespace_defender/info.yml
simulation:
- atomic_guid: 59d386fc-3a4b-41b8-850d-9e3eee24dfe4
  name: WMIC Tamper with Windows Defender Evade Scanning Folder
  technique: T1562.001
  type: atomic-red-team
status: test
tags:
- attack.execution
- attack.defense-impairment
- attack.t1047
- attack.t1685
title: Potential Windows Defender Tampering Via Wmic.EXE
