author: Nasreddine Bencherchali (Nextron Systems)
custom:
  wazuh_rule_id: 200307
date: 2022-08-19
description: 'Detects uncommon child processes spawning from "sigverif.exe", which
  could indicate potential abuse of the latter as a living of the land binary in order
  to proxy execution.

  '
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_werfault:
    Image:
    - C:\Windows\System32\WerFault.exe
    - C:\Windows\SysWOW64\WerFault.exe
  selection:
    ParentImage|endswith: \sigverif.exe
falsepositives:
- Unknown
id: 7d4aaec2-08ed-4430-8b96-28420e030e04
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2024-08-27
references:
- https://www.hexacorn.com/blog/2018/04/27/i-shot-the-sigverif-exe-the-gui-based-lolbin/
- https://twitter.com/0gtweet/status/1457676633809330184
status: test
tags:
- attack.stealth
- attack.t1216
title: Uncommon Sigverif.EXE Child Process
