author: Daniel Koifman (KoifSec)
custom:
  wazuh_rule_id: 200045
date: 2025-07-30
description: 'Detects the use of wmic.exe to modify user account settings and explicitly
  disable password expiration.

  '
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains|all:
    - useraccount
    - ' set '
    - passwordexpires
    - 'false'
  selection_img:
  - Image|endswith: \wmic.exe
  - OriginalFileName: wmic.exe
falsepositives:
- Legitimate administrative activity
id: 7864a175-3654-4824-9f0d-f0da18ab27c0
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://www.huntress.com/blog/the-unwanted-guest
status: experimental
tags:
- attack.privilege-escalation
- attack.execution
- attack.persistence
- attack.t1047
- attack.t1098
title: Password Set to Never Expire via WMI
