author: Swachchhanda Shrawan Poudel (Nextron Systems)
custom:
  wazuh_rule_id: 200484
date: 2026-03-11
description: 'Detects system restore registry modification via command line, which
  can be used by adversaries to disable system restore on the computer.

  '
detection:
  condition: all of selection_*
  selection_cli_action:
    CommandLine|contains:
    - ' add '
    - Set-ItemProperty
    - New-ItemProperty
  selection_cli_reg_key:
    CommandLine|contains:
    - DisableConfig
    - DisableSR
  selection_cli_reg_root:
    CommandLine|contains:
    - \SOFTWARE\Policies\Microsoft\Windows NT\SystemRestore
    - \SOFTWARE\Microsoft\Windows NT\CurrentVersion\SystemRestore
  selection_img:
  - Image|endswith:
    - \powershell.exe
    - \pwsh.exe
    - \reg.exe
  - OriginalFileName:
    - powershell.exe
    - pwsh.dll
    - reg.exe
falsepositives:
- Unknown
id: 7c06ab9b-b1d2-4ba9-b06e-09491ded20d9
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1490/T1490.md#atomic-test-9---disable-system-restore-through-registry
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_reg_system_restore_modification/info.yml
related:
- id: 5de03871-5d46-4539-a82d-3aa992a69a83
  type: similar
simulation:
- atomic_guid: 66e647d1-8741-4e43-b7c1-334760c2047f
  name: Disable System Restore Through Registry
  technique: T1490
  type: atomic-red-team
status: experimental
tags:
- attack.impact
- attack.t1490
title: System Restore Registry Modification via CommandLine
