author: Liran Ravich, Nasreddine Bencherchali
custom:
  wazuh_rule_id: 200050
date: 2025-10-22
description: 'Detects the execution of Winrs.exe where it is used to execute commands
  locally.

  Commands executed this way are launched under Winrshost.exe and can represent proxy
  execution used for defense evasion or lateral movement.

  '
detection:
  condition: all of selection_* or (selection_img and not 1 of filter_main_*)
  filter_main_remote:
    CommandLine|contains|windash:
    - '/r:'
    - '/remote:'
  selection_img:
  - Image|endswith: \winrs.exe
  - OriginalFileName: winrs.exe
  selection_local_ip:
    CommandLine|contains|windash:
    - /r:localhost
    - /r:127.0.0.1
    - /r:[::1]
    - /remote:localhost
    - /remote:127.0.0.1
    - /remote:[::1]
falsepositives:
- Unlikely
id: bcfece3d-56fe-4545-9931-3b8e92927db1
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://cardinalops.com/blog/living-off-winrm-abusing-complexity-in-remote-management/
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/winrs
status: experimental
tags:
- attack.lateral-movement
- attack.stealth
- attack.t1021.006
- attack.t1218
title: Winrs Local Command Execution
