author: Jakob Weinzettl, oscd.community, Nasreddine Bencherchali (Nextron Systems)
custom:
  wazuh_rule_id: 200345
date: 2023-03-05
description: Detects the stopping of a Windows service via the "sc.exe" utility
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains: ' stop '
  selection_img:
  - OriginalFileName: sc.exe
  - Image|endswith: \sc.exe
falsepositives:
- There are many legitimate reasons to stop a service. This rule isn't looking for
  any suspicious behavior in particular. Filter legitimate activity accordingly
id: 81bcb81b-5b1f-474b-b373-52c871aaa7b1
level: low
logsource:
  category: process_creation
  product: windows
modified: 2024-01-18
references:
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc742107(v=ws.11)
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_sc_stop_service/info.yml
related:
- id: eb87818d-db5d-49cc-a987-d5da331fbd90
  type: obsolete
status: test
tags:
- attack.impact
- attack.t1489
title: Stop Windows Service Via Sc.EXE
