author: Florian Roth (Nextron Systems), Patrick Bareiss, Anton Kutepov, oscd.community,
  Nasreddine Bencherchali (Nextron Systems)
custom:
  wazuh_rule_id: 200192
date: 2017-11-27
description: 'Detects the execution of a Windows system binary that is usually located
  in the system folder from an uncommon location.

  '
detection:
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
  filter_main_generic:
    Image|startswith:
    - C:\$WINDOWS.~BT\
    - C:\$WinREAgent\
    - C:\Windows\SoftwareDistribution\
    - C:\Windows\System32\
    - C:\Windows\SystemTemp\
    - C:\Windows\SysWOW64\
    - C:\Windows\uus\
    - C:\Windows\WinSxS\
  filter_main_powershell:
    Image|contains:
    - C:\Program Files\PowerShell\7\
    - C:\Program Files\PowerShell\7-preview\
    - C:\Program Files\WindowsApps\Microsoft.PowerShellPreview
    - \AppData\Local\Microsoft\WindowsApps\Microsoft.PowerShellPreview
    Image|endswith: \pwsh.exe
  filter_main_wsl_appdata:
    Image|contains: \AppData\Local\Microsoft\WindowsApps\
    Image|endswith: \wsl.exe
    Image|startswith: C:\Users\'
  filter_main_wsl_programfiles:
    Image|endswith: \wsl.exe
    Image|startswith:
    - C:\Program Files\WindowsApps\MicrosoftCorporationII.WindowsSubsystemForLinux
    - C:\Program Files\WSL\
  filter_optional_system32:
    Image|contains: \SystemRoot\System32\
  selection:
    Image|endswith:
    - \atbroker.exe
    - \audiodg.exe
    - \bcdedit.exe
    - \bitsadmin.exe
    - \certreq.exe
    - \certutil.exe
    - \cmstp.exe
    - \conhost.exe
    - \consent.exe
    - \cscript.exe
    - \csrss.exe
    - \dashost.exe
    - \defrag.exe
    - \dfrgui.exe
    - \dism.exe
    - \dllhost.exe
    - \dllhst3g.exe
    - \dwm.exe
    - \eventvwr.exe
    - \fsquirt.exe
    - \finger.exe
    - \logonui.exe
    - \LsaIso.exe
    - \lsass.exe
    - \lsm.exe
    - \msiexec.exe
    - \ntoskrnl.exe
    - \powershell_ise.exe
    - \powershell.exe
    - \pwsh.exe
    - \regsvr32.exe
    - \rundll32.exe
    - \runonce.exe
    - \RuntimeBroker.exe
    - \schtasks.exe
    - \services.exe
    - \sihost.exe
    - \smartscreen.exe
    - \smss.exe
    - \spoolsv.exe
    - \svchost.exe
    - \taskhost.exe
    - \taskhostw.exe
    - \Taskmgr.exe
    - \userinit.exe
    - \werfault.exe
    - \werfaultsecure.exe
    - \wininit.exe
    - \winlogon.exe
    - \winver.exe
    - \wlanext.exe
    - \wscript.exe
    - \wsl.exe
    - \wsmprovhost.exe
falsepositives:
- Unknown
id: e4a6b256-3e47-40fc-89d2-7a477edd6915
level: high
logsource:
  category: process_creation
  product: windows
modified: 2026-02-12
references:
- https://twitter.com/GelosSnake/status/934900723426439170
- https://asec.ahnlab.com/en/39828/
- https://www.splunk.com/en_us/blog/security/inno-setup-malware-redline-stealer-campaign.html
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_susp_system_exe_anomaly/info.yml
related:
- id: be58d2e2-06c8-4f58-b666-b99f6dc3b6cd
  type: derived
status: test
tags:
- attack.stealth
- attack.t1036
title: System File Execution Location Anomaly
