author: Margaritis Dimitrios (idea), Florian Roth (Nextron Systems), oscd.community,
  Nasreddine Bencherchali (Nextron Systems), Dave Johnson
custom:
  wazuh_rule_id: 200013
date: 2019-01-16
description: Detects wscript/cscript/mshta executions of scripts located in user directories
detection:
  condition: all of selection_*
  selection_exec:
    Image|endswith:
    - \wscript.exe
    - \cscript.exe
    - \mshta.exe
  selection_ext:
    CommandLine|contains:
    - .hta
    - .js
    - .jse
    - .vba
    - .vbe
    - .vbs
    - .wsf
    - .wsh
  selection_paths:
    CommandLine|contains:
    - :\Perflogs\
    - :\Temp\
    - :\Tmp\
    - :\Users\Public\
    - :\Windows\Temp\
    - \AppData\Local\Temp\
    - \AppData\Roaming\Temp\
    - \Start Menu\Programs\Startup\
    - \Temporary Internet
    - \Windows\Temp
    - '%LocalAppData%\Temp\'
    - '%TEMP%'
    - '%TMP%'
falsepositives:
- Some installers might generate a similar behavior. An initial baseline is required
id: cea72823-df4d-4567-950c-0b579eaf0846
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2026-02-17
references:
- https://thedfirreport.com/2023/10/30/netsupport-intrusion-results-in-domain-compromise/
- https://redcanary.com/blog/gootloader/
- https://www.microsoft.com/en-us/security/blog/2025/03/06/malvertising-campaign-leads-to-info-stealers-hosted-on-github/
related:
- id: 1e33157c-53b1-41ad-bbcc-780b80b58288
  type: similar
status: test
tags:
- attack.execution
- attack.t1059.005
- attack.t1059.007
title: Potential Dropper Script Execution Via WScript/CScript/MSHTA
