author: frack113
custom:
  wazuh_rule_id: 201000
date: 2021-12-27
description: Look for the encrypted cpassword value within Group Policy Preference
  files on the Domain Controller. This value can be decrypted with gpp-decrypt.
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains|all:
    - cpassword
    - \sysvol\
    - .xml
  selection_img:
  - Image|endswith:
    - \find.exe
    - \findstr.exe
  - OriginalFileName:
    - FIND.EXE
    - FINDSTR.EXE
falsepositives:
- Unknown
id: 91a2c315-9ee6-4052-a853-6f6a8238f90d
level: high
logsource:
  category: process_creation
  product: windows
modified: 2023-11-11
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1552.006/T1552.006.md#atomic-test-1---gpp-passwords-findstr
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_findstr_gpp_passwords/info.yml
simulation:
- atomic_guid: 870fe8fb-5e23-4f5f-b89d-dd7fe26f3b5f
  name: GPP Passwords (findstr)
  technique: T1552.006
  type: atomic-red-team
status: test
tags:
- attack.credential-access
- attack.t1552.006
title: Findstr GPP Passwords
