author: Michael Haag, FPT.EagleEye
custom:
  wazuh_rule_id: 201149
date: 2017-03-09
description: Detects usage of bitsadmin downloading a file
detection:
  condition: selection_img and (selection_cmd or all of selection_cli_*)
  selection_cli_1:
    CommandLine|contains:
    - ' /create '
    - ' /addfile '
  selection_cli_2:
    CommandLine|contains: http
  selection_cmd:
    CommandLine|contains: ' /transfer '
  selection_img:
  - Image|endswith: \bitsadmin.exe
  - OriginalFileName: bitsadmin.exe
falsepositives:
- Some legitimate apps use this, but limited.
id: d059842b-6b9d-4ed1-b5c3-5b89143c6ede
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2023-02-15
references:
- https://blog.netspi.com/15-ways-to-download-a-file/#bitsadmin
- https://isc.sans.edu/diary/22264
- https://lolbas-project.github.io/lolbas/Binaries/Bitsadmin/
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_bitsadmin_download/info.yml
simulation:
- atomic_guid: a1921cd3-9a2d-47d5-a891-f1d0f2a7a31b
  name: Windows - BITSAdmin BITS Download
  technique: T1105
  type: atomic-red-team
status: test
tags:
- attack.persistence
- attack.execution
- attack.stealth
- attack.t1197
- attack.s0190
- attack.t1036.003
- attack.command-and-control
- attack.t1105
title: File Download Via Bitsadmin
