author: andrewdanis
custom:
  wazuh_rule_id: 200304
date: 2025-10-23
description: 'Detects suspicious Speech Runtime Binary Execution by monitoring its
  child processes.

  Child processes spawned by SpeechRuntime.exe could indicate an attempt for lateral
  movement via COM & DCOM hijacking.

  '
detection:
  condition: selection
  selection:
    ParentImage|endswith: \SpeechRuntime.exe
falsepositives:
- Unlikely.
id: 78f10490-f2f4-4d19-a75b-4e0683bf3b8d
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/rtecCyberSec/SpeechRuntimeMove
status: experimental
tags:
- attack.lateral-movement
- attack.stealth
- attack.t1021.003
- attack.t1218
title: Suspicious Speech Runtime Binary Child Process
