author: Nasreddine Bencherchali (Nextron Systems)
custom:
  wazuh_rule_id: 200612
date: 2023-04-21
description: Detects calls to PowerShell with Invoke-WebRequest cmdlet using direct
  IP access
detection:
  condition: all of selection_*
  selection_commands:
    CommandLine|contains:
    - 'curl '
    - Invoke-RestMethod
    - Invoke-WebRequest
    - ' irm '
    - 'iwr '
    - 'wget '
  selection_img:
  - Image|endswith:
    - \powershell_ise.exe
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - powershell_ise.EXE
    - PowerShell.EXE
    - pwsh.dll
  selection_ip:
    CommandLine|contains:
    - ://1
    - ://2
    - ://3
    - ://4
    - ://5
    - ://6
    - ://7
    - ://8
    - ://9
falsepositives:
- Unknown
id: 1edff897-9146-48d2-9066-52e8d8f80a2f
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://www.huntress.com/blog/critical-vulnerabilities-in-papercut-print-management-software
status: test
tags:
- attack.command-and-control
- attack.t1105
title: Suspicious Invoke-WebRequest Execution With DirectIP
