author: David Faiss
custom:
  wazuh_rule_id: 200094
date: 2025-05-26
description: 'Detects the invocation of vshadow.exe with the -exec parameter that
  executes a specified script or command after the shadow copies are created but before
  the VShadow tool exits.

  VShadow is a command-line tool that you can use to create and manage volume shadow
  copies. While legitimate backup or administrative scripts may use this flag,

  attackers can leverage this parameter to proxy the execution of malware.

  '
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains: -exec
  selection_img:
  - Image|endswith: \vshadow.exe
  - OriginalFileName: vshadow.exe
falsepositives:
- System backup or administrator tools
- Legitimate administrative scripts
id: d7c75059-2901-4578-b209-8837fd31c6a8
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Vshadow/
- https://learn.microsoft.com/en-us/windows/win32/vss/vshadow-tool-and-sample
status: experimental
tags:
- attack.stealth
- attack.t1202
title: Proxy Execution via Vshadow
