author: X__Junior (Nextron Systems)
custom:
  wazuh_rule_id: 200003
date: 2023-11-26
description: 'Detects execution of the "wusa.exe" (Windows Update Standalone Installer)
  utility by a parent process that is located in a suspicious location.

  Attackers could instantiate an instance of "wusa.exe" in order to bypass User Account
  Control (UAC). They can duplicate the access token from "wusa.exe" to gain elevated
  privileges.

  '
detection:
  condition: selection_img and 1 of selection_paths_* and not 1 of filter_main_*
  filter_main_msu:
    CommandLine|contains: .msu
  selection_img:
    Image|endswith: \wusa.exe
  selection_paths_1:
    ParentImage|contains:
    - :\Perflogs\
    - :\Users\Public\
    - :\Windows\Temp\
    - \Appdata\Local\Temp\
    - \Temporary Internet
  selection_paths_2:
  - ParentImage|contains|all:
    - :\Users\
    - \Favorites\
  - ParentImage|contains|all:
    - :\Users\
    - \Favourites\
  - ParentImage|contains|all:
    - :\Users\
    - \Contacts\
  - ParentImage|contains|all:
    - :\Users\
    - \Pictures\
falsepositives:
- Unknown
id: ef64fc9c-a45e-43cc-8fd8-7d75d73b4c99
level: high
logsource:
  category: process_creation
  product: windows
modified: 2024-08-15
references:
- https://www.fortinet.com/blog/threat-research/konni-campaign-distributed-via-malicious-document
status: test
tags:
- attack.execution
title: Wusa.EXE Executed By Parent Process Located In Suspicious Location
