author: Swachchhanda Shrawan Poudel (Nextron Systems)
custom:
  wazuh_rule_id: 201160
date: 2025-12-25
description: 'Detects attempts to disable Windows EventLog autologger sessions via
  registry modification.

  The AutoLogger event tracing session records events that occur early in the operating
  system boot process.

  Applications and device drivers can use the AutoLogger session to capture traces
  before the user logs in.

  Adversaries may disable these sessions to evade detection and prevent security monitoring
  of early boot activities and system events.

  '
detection:
  condition: all of selection_*
  selection_cli_action:
    CommandLine|contains:
    - 'add '
    - Set-ItemProperty
    - New-ItemProperty
    - 'si '
  selection_cli_base:
    CommandLine|contains: \Control\WMI\Autologger\
  selection_cli_key:
    CommandLine|contains:
    - Start
    - Enabled
  selection_img:
  - Image|endswith:
    - \reg.exe
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - reg.exe
    - PowerShell.EXE
    - pwsh.dll
falsepositives:
- Unknown
id: d7b81144-b866-48a4-9bcc-275dc69d870e
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://learn.microsoft.com/en-us/windows/win32/etw/configuring-and-starting-an-autologger-session
- https://ptylu.github.io/content/report/report.html?report=25
- https://blog.palantir.com/tampering-with-windows-event-tracing-background-offense-and-defense-4be7ac62ac63
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_autologger_session_registry_modification/info.yml
related:
- id: f37b4bce-49d0-4087-9f5b-58bffda77316
  type: similar
simulation:
- atomic_guid: 653c6e17-14a2-4849-851d-f1c0cc8ea9ab
  name: Disable EventLog-Application Auto Logger Session Via Registry - Cmd
  technique: T1562.001
  type: atomic-red-team
- atomic_guid: da86f239-9bd3-4e85-92ed-4a94ef111a1c
  name: Disable EventLog-Application Auto Logger Session Via Registry - PowerShell
  technique: T1562.001
  type: atomic-red-team
- atomic_guid: 1cac9b54-810e-495c-8aac-989e0076583b
  name: Disable EventLog-Application ETW Provider Via Registry - Cmd
  technique: T1562.001
  type: atomic-red-team
- atomic_guid: 8f907648-1ebf-4276-b0f0-e2678ca474f0
  name: Disable EventLog-Application ETW Provider Via Registry - PowerShell
  technique: T1562.001
  type: atomic-red-team
status: experimental
tags:
- attack.defense-impairment
- attack.t1685.001
title: Windows EventLog Autologger Session Registry Modification Via CommandLine
