author: Nikita Nazarov, oscd.community
custom:
  wazuh_rule_id: 200921
date: 2020-10-08
description: Detects Obfuscated Powershell via use MSHTA in Scripts
detection:
  condition: selection
  selection:
    CommandLine|contains|all:
    - set
    - '&&'
    - mshta
    - vbscript:createobject
    - .run
    - (window.close)
falsepositives:
- Unknown
id: ac20ae82-8758-4f38-958e-b44a3140ca88
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022-03-08
references:
- https://github.com/SigmaHQ/sigma/issues/1009
status: test
tags:
- attack.stealth
- attack.t1027
- attack.execution
- attack.t1059.001
title: Invoke-Obfuscation Via Use MSHTA
