author: Nasreddine Bencherchali (Nextron Systems)
custom:
  wazuh_rule_id: 201142
date: 2023-09-12
description: Detects execution of Chromium based browser in headless mode
detection:
  condition: selection
  selection:
    CommandLine|contains: --headless
    Image|endswith:
    - \brave.exe
    - \chrome.exe
    - \msedge.exe
    - \opera.exe
    - \vivaldi.exe
falsepositives:
- Unknown
id: ef9dcfed-690c-4c5d-a9d1-482cd422225c
level: low
logsource:
  category: process_creation
  product: windows
references:
- https://twitter.com/mrd0x/status/1478234484881436672?s=12
- https://www.trendmicro.com/en_us/research/23/e/managed-xdr-investigation-of-ducktail-in-trend-micro-vision-one.html
related:
- id: 0e8cfe08-02c9-4815-a2f8-0d157b7ed33e
  type: derived
status: test
tags:
- attack.command-and-control
- attack.stealth
- attack.t1105
- attack.t1564.003
title: Browser Execution In Headless Mode
