author: Nasreddine Bencherchali (Nextron Systems)
custom:
  wazuh_rule_id: 200991
date: 2023-02-13
description: Detect filter driver unloading activity via fltmc.exe
detection:
  condition: all of selection_* and not 1 of filter_optional_*
  filter_optional_avira:
    CommandLine|endswith:
    - unload rtp_filesystem_filter
    - unload rtp_filter
    ParentImage|contains:
    - \AppData\Local\Temp\
    - :\Windows\Temp\
    ParentImage|endswith: \endpoint-protection-installer-x64.tmp
  filter_optional_manageengine:
    CommandLine|endswith: unload DFMFilter
    ParentImage: C:\Program Files (x86)\ManageEngine\uems_agent\bin\dcfaservice64.exe
  selection_cli:
    CommandLine|contains: unload
  selection_img:
  - Image|endswith: \fltMC.exe
  - OriginalFileName: fltMC.exe
falsepositives:
- Unknown
id: 4931188c-178e-4ee7-a348-39e8a7a56821
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2025-10-07
references:
- https://www.darkoperator.com/blog/2018/10/5/operating-offensively-against-sysmon
- https://www.cybereason.com/blog/threat-analysis-report-lockbit-2.0-all-paths-lead-to-ransom
related:
- id: 4d7cda18-1b12-4e52-b45c-d28653210df8
  type: derived
status: test
tags:
- attack.stealth
- attack.defense-impairment
- attack.t1070
- attack.t1685
- attack.t1685.001
title: Filter Driver Unloaded Via Fltmc.EXE
