author: frack113
custom:
  wazuh_rule_id: 200722
date: 2022-08-14
description: Detects the removal of a port or application rule in the Windows Firewall
  configuration using netsh
detection:
  condition: all of selection_* and not 1 of filter_optional_*
  filter_optional_avast:
    CommandLine|contains: advfirewall firewall delete rule name="Avast Antivirus Admin
      Client"
    ParentImage|endswith: \instup.exe
  filter_optional_dropbox:
    CommandLine|contains: name=Dropbox
    ParentImage|endswith: \Dropbox.exe
  selection_cli:
    CommandLine|contains|all:
    - firewall
    - 'delete '
  selection_img:
  - Image|endswith: \netsh.exe
  - OriginalFileName: netsh.exe
falsepositives:
- Legitimate administration activity
- Software installations and removal
id: 1a5fefe6-734f-452e-a07d-fc1c35bce4b2
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2025-10-07
references:
- https://app.any.run/tasks/8bbd5b4c-b82d-4e6d-a3ea-d454594a37cc/
status: test
tags:
- attack.defense-impairment
- attack.t1686.003
title: Firewall Rule Deleted Via Netsh.EXE
