author: frack113, Florian Roth
custom:
  wazuh_rule_id: 200553
date: 2022-09-02
description: Detects the use of Fast Reverse Proxy. frp is a fast reverse proxy to
  help you expose a local server behind a NAT or firewall to the Internet.
detection:
  condition: 1 of selection_*
  selection_cli:
    CommandLine|contains: \frpc.ini
  selection_hashes:
    Hashes|contains:
    - MD5=7D9C233B8C9E3F0EA290D2B84593C842
    - SHA1=06DDC9280E1F1810677935A2477012960905942F
    - SHA256=57B0936B8D336D8E981C169466A15A5FD21A7D5A2C7DAF62D5E142EE860E387C
  selection_img:
    Image|endswith:
    - \frpc.exe
    - \frps.exe
falsepositives:
- Legitimate use
id: 32410e29-5f94-4568-b6a3-d91a8adad863
level: high
logsource:
  category: process_creation
  product: windows
modified: 2024-11-23
references:
- https://asec.ahnlab.com/en/38156/
- https://github.com/fatedier/frp
status: test
tags:
- attack.command-and-control
- attack.t1090
title: PUA - Fast Reverse Proxy (FRP) Execution
