author: frack113
custom:
  wazuh_rule_id: 200020
date: 2022-01-28
description: Detects the removal or uninstallation of an application via "Wmic.EXE".
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains|all:
    - call
    - uninstall
  selection_img:
  - Image|endswith: \WMIC.exe
  - OriginalFileName: wmic.exe
falsepositives:
- Unknown
id: b53317a0-8acf-4fd1-8de8-a5401e776b96
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2024-07-02
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1047/T1047.md#atomic-test-10---application-uninstall-using-wmic
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_wmic_uninstall_application/info.yml
related:
- id: 847d5ff3-8a31-4737-a970-aeae8fe21765
  type: derived
simulation:
- atomic_guid: c510d25b-1667-467d-8331-a56d3e9bc4ff
  name: Application uninstall using WMIC
  technique: T1047
  type: atomic-red-team
status: test
tags:
- attack.execution
- attack.t1047
title: Application Removed Via Wmic.EXE
