author: Nasreddine Bencherchali (Nextron Systems)
custom:
  wazuh_rule_id: 200733
date: 2023-02-21
description: Detects when an internet hosted webdav share is mounted using the "net.exe"
  utility
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains|all:
    - ' use '
    - ' http'
  selection_img:
  - Image|endswith:
    - \net.exe
    - \net1.exe
  - OriginalFileName:
    - net.exe
    - net1.exe
falsepositives:
- Unknown
id: 7e6237fe-3ddb-438f-9381-9bf9de5af8d0
level: high
logsource:
  category: process_creation
  product: windows
modified: 2023-07-25
references:
- https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view
status: test
tags:
- attack.lateral-movement
- attack.t1021.002
title: Windows Internet Hosted WebDav Share Mount Via Net.EXE
