author: frack113, Nasreddine Bencherchali (Nextron Systems)
custom:
  wazuh_rule_id: 200033
date: 2023-02-14
description: 'An adversary might use WMI to check if a certain remote service is running
  on a remote device.

  When the test completes, a service information will be displayed on the screen if
  it exists.

  A common feedback message is that "No instance(s) Available" if the service queried
  is not running.

  A common error message is "Node - (provided IP or default) ERROR Description =The
  RPC server is unavailable" if the provided remote host is unreachable

  '
detection:
  condition: all of selection_* and not 1 of filter_main_*
  filter_main_manipulation:
    CommandLine|contains:
    - stopservice
    - startservice
  filter_main_win32_methods:
    CommandLine|contains:
    - Change
    - Create
    - Delete
    - PauseService
    - ResumeService
    - SetSecurityDescriptor
    - StartService
    - StopService
    - UserControlService
  selection_cli:
    CommandLine|contains: service
  selection_img:
  - Image|endswith: \WMIC.exe
  - OriginalFileName: wmic.exe
falsepositives:
- Unknown
id: 76f55eaa-d27f-4213-9d45-7b0e4b60bbae
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2026-01-07
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1047/T1047.md
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/wmic
- https://learn.microsoft.com/en-us/windows/win32/cimwin32prov/win32-service
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_wmic_recon_service/info.yml
related:
- id: 68bcd73b-37ef-49cb-95fc-edc809730be6
  type: similar
simulation:
- atomic_guid: 0fd48ef7-d890-4e93-a533-f7dedd5191d3
  name: WMI Reconnaissance List Remote Services
  technique: T1047
  type: atomic-red-team
status: test
tags:
- attack.execution
- attack.t1047
title: Service Reconnaissance Via Wmic.EXE
