author: Christopher Peacock @SecurePeacock, SCYTHE @scythe_io
custom:
  wazuh_rule_id: 200986
date: 2022-06-02
description: 'Detects the execution of FSharp Interpreters "FsiAnyCpu.exe" and "FSi.exe"

  Both can be used for AWL bypass and to execute F# code via scripts or inline.

  '
detection:
  condition: selection
  selection:
  - Image|endswith:
    - \fsi.exe
    - \fsianycpu.exe
  - OriginalFileName:
    - fsi.exe
    - fsianycpu.exe
falsepositives:
- Legitimate use by a software developer.
id: b96b2031-7c17-4473-afe7-a30ce714db29
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2024-04-23
references:
- https://learn.microsoft.com/en-us/windows/security/application-security/application-control/windows-defender-application-control/design/applications-that-can-bypass-wdac
- https://bohops.com/2020/11/02/exploring-the-wdac-microsoft-recommended-block-rules-part-ii-wfc-fsi/
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/FsiAnyCpu/
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Fsi/
status: test
tags:
- attack.execution
- attack.t1059
title: Use of FSharp Interpreters
