author: frack113
custom:
  wazuh_rule_id: 200797
date: 2021-07-12
description: Executes arbitrary PowerShell code using SyncAppvPublishingServer.exe.
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains: '"n; '
  selection_img:
  - Image|endswith: \SyncAppvPublishingServer.exe
  - OriginalFileName: syncappvpublishingserver.exe
falsepositives:
- App-V clients
id: fbd7c32d-db2a-4418-b92c-566eb8911133
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022-10-04
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218/T1218.md
- https://lolbas-project.github.io/lolbas/Binaries/Syncappvpublishingserver/
related:
- id: fde7929d-8beb-4a4c-b922-be9974671667
  type: obsolete
status: test
tags:
- attack.stealth
- attack.t1218
title: SyncAppvPublishingServer Execute Arbitrary PowerShell Code
