author: Swachchhanda Shrawan Poudel (Nextron Systems)
custom:
  wazuh_rule_id: 200842
date: 2025-06-20
description: 'Detects the presence of "UWhRC....AAYBAAAA" pattern in command line.

  The pattern "1UWhRCAAAAA..BAAAA" is a base64-encoded signature that corresponds
  to a marshaled CREDENTIAL_TARGET_INFORMATION structure.

  Attackers can use this technique to coerce authentication from victim systems to
  attacker-controlled hosts.

  It is one of the strong indicators of a Kerberos coercion attack, where adversaries
  manipulate DNS records

  to spoof Service Principal Names (SPNs) and redirect authentication requests like
  in CVE-2025-33073.

  If you see this pattern in the command line, it is likely an attempt to add spoofed
  Service Principal Names (SPNs) to DNS records,

  or checking for the presence of such records through the `nslookup` command.

  '
detection:
  condition: selection
  selection:
    CommandLine|contains|all:
    - UWhRCA
    - BAAAA
falsepositives:
- Unknown
id: 0ed99dda-6a35-11ef-8c99-0242ac120002
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://www.synacktiv.com/publications/ntlm-reflection-is-dead-long-live-ntlm-reflection-an-in-depth-analysis-of-cve-2025
- https://googleprojectzero.blogspot.com/2021/10/using-kerberos-for-authentication-relay.html
related:
- id: b07e58cf-cacc-4135-8473-ccb2eba63dd2
  type: similar
status: experimental
tags:
- attack.collection
- attack.credential-access
- attack.persistence
- attack.privilege-escalation
- attack.t1557.001
- attack.t1187
title: Attempts of Kerberos Coercion Via DNS SPN Spoofing
