author: Florian Roth (Nextron Systems)
custom:
  wazuh_rule_id: 200473
date: 2021-05-27
description: Detects a regedit started with TrustedInstaller privileges or by ProcessHacker.exe
detection:
  condition: selection
  selection:
    Image|endswith: \regedit.exe
    ParentImage|endswith:
    - \TrustedInstaller.exe
    - \ProcessHacker.exe
falsepositives:
- Unlikely
id: 883835a7-df45-43e4-bf1d-4268768afda4
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022-10-09
references:
- https://twitter.com/1kwpeter/status/1397816101455765504
status: test
tags:
- attack.privilege-escalation
- attack.t1548
title: Regedit as Trusted Installer
