author: David Burkett, @signalblur
custom:
  wazuh_rule_id: 200180
date: 2019-12-28
description: It is extremely abnormal for svchost.exe to spawn without any CLI arguments
  and is normally observed when a malicious process spawns the process and injects
  code into the process memory space.
detection:
  condition: selection and not filter
  filter:
  - ParentImage|endswith:
    - \rpcnet.exe
    - \rpcnetp.exe
  - CommandLine: null
  selection:
    CommandLine|endswith: svchost.exe
    Image|endswith: \svchost.exe
falsepositives:
- Rpcnet.exe / rpcnetp.exe which is a lojack style software. https://www.blackhat.com/docs/us-14/materials/us-14-Kamlyuk-Kamluk-Computrace-Backdoor-Revisited.pdf
id: 16c37b52-b141-42a5-a3ea-bbe098444397
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022-06-27
references:
- https://web.archive.org/web/20180718061628/https://securitybytes.io/blue-team-fundamentals-part-two-windows-processes-759fe15965e2
status: test
tags:
- attack.privilege-escalation
- attack.stealth
- attack.t1055
title: Suspect Svchost Activity
