author: frack113, Nasreddine Bencherchali
custom:
  wazuh_rule_id: 200220
date: 2022-08-07
description: Detect use of the Windows 8.3 short name. Which could be used as a method
  to avoid Image detection
detection:
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
  filter_main_installers:
  - Image|contains|all:
    - \AppData\
    - \Temp\
  - Image|endswith:
    - ~1\unzip.exe
    - ~1\7zG.exe
  filter_main_system_process:
    ParentImage:
    - C:\Windows\System32\Dism.exe
    - C:\Windows\System32\cleanmgr.exe
  filter_optional_installshield:
  - Product: InstallShield (R)
  - Description: InstallShield (R) Setup Engine
  - Company: InstallShield Software Corporation
  filter_optional_thor:
    ParentImage|endswith: \thor\thor64.exe
  filter_optional_webex:
    ParentImage|endswith: \WebEx\WebexHost.exe
  selection:
    Image|contains:
    - ~1\
    - ~2\
falsepositives:
- Applications could use this notation occasionally which might generate some false
  positives. In that case Investigate the parent and child process.
id: a96970af-f126-420d-90e1-d37bf25e50e1
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2025-10-20
references:
- https://www.acunetix.com/blog/articles/windows-short-8-3-filenames-web-security-problem/
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-2000-server/cc959352(v=technet.10)
- https://twitter.com/frack113/status/1555830623633375232
related:
- id: 349d891d-fef0-4fe4-bc53-eee623a15969
  type: similar
status: test
tags:
- attack.stealth
- attack.t1564.004
title: Use Short Name Path in Image
