author: Nasreddine Bencherchali (Nextron Systems)
custom:
  wazuh_rule_id: 200339
date: 2022-09-09
description: Detects when adversaries stop services or processes by deleting their
  respective scheduled tasks in order to conduct data destructive activities
detection:
  condition: all of selection_*
  selection_cli_delete:
    CommandLine|contains|windash: /delete
  selection_cli_task:
    CommandLine|contains:
    - \Windows\BitLocker
    - \Windows\ExploitGuard
    - \Windows\SystemRestore\SR
    - \Windows\UpdateOrchestrator\
    - \Windows\Windows Defender\
    - \Windows\WindowsBackup\
    - \Windows\WindowsUpdate\
  selection_img:
  - Image|endswith: \schtasks.exe
  - OriginalFileName: schtasks.exe
falsepositives:
- Unlikely
id: dbc1f800-0fe0-4bc0-9c66-292c2abe3f78
level: high
logsource:
  category: process_creation
  product: windows
modified: 2026-03-11
references:
- Internal Research
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_schtasks_delete/info.yml
related:
- id: 9e3cb244-bdb8-4632-8c90-6079c8f4f16d
  type: similar
- id: 7595ba94-cf3b-4471-aa03-4f6baa9e5fad
  type: similar
status: test
tags:
- attack.impact
- attack.t1489
title: Delete Important Scheduled Task
