author: Florian Roth (Nextron Systems)
custom:
  wazuh_rule_id: 200675
date: 2021-01-19
description: Detects suspicious Plink tunnel port forwarding to a local port
detection:
  condition: selection
  selection:
    CommandLine|contains: ' -R '
    Description: Command-line SSH, Telnet, and Rlogin client
falsepositives:
- Administrative activity using a remote port forwarding to a local port
id: 48a61b29-389f-4032-b317-b30de6b95314
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022-10-09
references:
- https://www.real-sec.com/2019/04/bypassing-network-restrictions-through-rdp-tunneling/
- https://medium.com/@informationsecurity/remote-ssh-tunneling-with-plink-exe-7831072b3d7d
status: test
tags:
- attack.command-and-control
- attack.t1572
- attack.lateral-movement
- attack.t1021.001
title: Suspicious Plink Port Forwarding
