author: Victor Sergeev, oscd.community
custom:
  wazuh_rule_id: 200982
date: 2020-10-09
description: Detects execution of "ftp.exe" script with the "-s" or "/s" flag and
  any child processes ran by "ftp.exe".
detection:
  condition: selection_parent or all of selection_child_*
  selection_child_cli:
    CommandLine|contains|windash: '-s:'
  selection_child_img:
  - Image|endswith: \ftp.exe
  - OriginalFileName: ftp.exe
  selection_parent:
    ParentImage|endswith: \ftp.exe
falsepositives:
- Unknown
id: 06b401f4-107c-4ff9-947f-9ec1e7649f1e
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2024-04-23
references:
- https://lolbas-project.github.io/lolbas/Binaries/Ftp/
status: test
tags:
- attack.execution
- attack.stealth
- attack.t1059
- attack.t1202
title: Potential Arbitrary Command Execution Via FTP.EXE
