author: Christian Burkard (Nextron Systems)
custom:
  wazuh_rule_id: 200130
date: 2021-08-23
description: Detects the pattern of UAC Bypass using consent.exe and comctl32.dll
  (UACMe 22)
detection:
  condition: selection
  selection:
    Image|endswith: \werfault.exe
    IntegrityLevel:
    - High
    - System
    - S-1-16-16384
    - S-1-16-12288
    ParentImage|endswith: \consent.exe
falsepositives:
- Unknown
id: 1ca6bd18-0ba0-44ca-851c-92ed89a61085
level: high
logsource:
  category: process_creation
  product: windows
modified: 2024-12-01
references:
- https://github.com/hfiref0x/UACME
status: test
tags:
- attack.privilege-escalation
- attack.t1548.002
title: UAC Bypass Using Consent and Comctl32 - Process
