author: Victor Sergeev, oscd.community
custom:
  wazuh_rule_id: 200804
date: 2020-10-09
description: Detects execution of powershell scripts via Runscripthelper.exe
detection:
  condition: selection
  selection:
    CommandLine|contains: surfacecheck
    Image|endswith: \Runscripthelper.exe
falsepositives:
- Unknown
id: eca49c87-8a75-4f13-9c73-a5a29e845f03
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022-07-11
references:
- https://lolbas-project.github.io/lolbas/Binaries/Runscripthelper/
status: test
tags:
- attack.execution
- attack.stealth
- attack.t1059
- attack.t1202
title: Suspicious Runscripthelper.exe
