author: Nasreddine Bencherchali (Nextron Systems)
custom:
  wazuh_rule_id: 200756
date: 2022-10-28
description: Detects usage of Msiexec.exe to install packages hosted remotely quietly
detection:
  condition: all of selection_* and not 1 of filter_optional_*
  filter_optional_openoffice:
    CommandLine|contains|all:
    - \AppData\Local\Temp\OpenOffice
    - Installation Files\openoffice
  selection_cli:
    CommandLine|contains|windash:
    - -i
    - -package
    - -a
    - -j
  selection_img:
  - Image|endswith: \msiexec.exe
  - OriginalFileName: msiexec.exe
  selection_quiet:
    CommandLine|contains|windash: -q
  selection_remote:
    CommandLine|contains:
    - http
    - \\\\
falsepositives:
- Unknown
id: 8150732a-0c9d-4a99-82b9-9efb9b90c40c
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2025-10-07
references:
- https://www.microsoft.com/en-us/security/blog/2022/10/27/raspberry-robin-worm-part-of-larger-ecosystem-facilitating-pre-ransomware-activity/
related:
- id: f7b5f842-a6af-4da5-9e95-e32478f3cd2f
  type: similar
status: test
tags:
- attack.stealth
- attack.t1218.007
title: Suspicious Msiexec Quiet Install From Remote Location
