author: Nasreddine Bencherchali (Nextron Systems)
custom:
  wazuh_rule_id: 200875
date: 2023-03-08
description: Detects the execution of PowerShell with a specific flag sequence that
  is used by the Wmiexec script
detection:
  condition: selection
  selection:
    CommandLine|contains: -NoP -NoL -sta -NonI -W Hidden -Exec Bypass -Enc
falsepositives:
- Unlikely
id: 022eaba8-f0bf-4dd9-9217-4604b0bb3bb0
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/fortra/impacket/blob/f4b848fa27654ca95bc0f4c73dbba8b9c2c9f30a/examples/wmiexec.py
status: test
tags:
- attack.lateral-movement
- attack.stealth
title: HackTool - Wmiexec Default Powershell Command
