author: Nasreddine Bencherchali (Nextron Systems)
custom:
  wazuh_rule_id: 200997
date: 2022-08-12
description: 'Detects usage of findstr with the "EVERYONE" or "BUILTIN" keywords.

  This was seen being used in combination with "icacls" and other utilities to spot
  misconfigured files or folders permissions.

  '
detection:
  condition: all of selection_findstr_* or selection_special
  selection_findstr_cli:
    CommandLine|contains:
    - '"Everyone"'
    - '''Everyone'''
    - '"BUILTIN\\"'
    - '''BUILTIN\'''
  selection_findstr_img:
  - Image|endswith:
    - \find.exe
    - \findstr.exe
  - OriginalFileName:
    - FIND.EXE
    - FINDSTR.EXE
  selection_special:
    CommandLine|contains|all:
    - 'icacls '
    - 'findstr '
    - Everyone
falsepositives:
- Unknown
id: 47e4bab7-c626-47dc-967b-255608c9a920
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2023-11-11
references:
- https://www.absolomb.com/2018-01-26-Windows-Privilege-Escalation-Guide/
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_findstr_recon_everyone/info.yml
status: test
tags:
- attack.credential-access
- attack.t1552.006
title: Permission Misconfiguration Reconnaissance Via Findstr.EXE
