author: andrewdanis, Swachchhanda Shrawan Poudel (Nextron Systems)
custom:
  wazuh_rule_id: 201158
date: 2025-10-18
description: 'Detects the execution of the BitLocker Access Agent Update Utility (baaupdate.exe)
  which is not a common parent process for other processes.

  Suspicious child processes spawned by baaupdate.exe could indicate an attempt at
  lateral movement via BitLocker DCOM & COM Hijacking.

  '
detection:
  condition: selection
  selection:
    Image|endswith:
    - \bitsadmin.exe
    - \cmd.exe
    - \cscript.exe
    - \mshta.exe
    - \powershell_ise.exe
    - \powershell.exe
    - \regsvr32.exe
    - \rundll32.exe
    - \schtasks.exe
    - \wmic.exe
    - \wscript.exe
    ParentImage|endswith: \baaupdate.exe
falsepositives:
- Unknown
id: 9f38c1db-e2ae-40bf-81d0-5b68f73fb512
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/rtecCyberSec/BitlockMove
related:
- id: 6e8fe0a8-ba0b-4a93-8f9e-82657e7a5984
  type: similar
status: experimental
tags:
- attack.stealth
- attack.t1218
- attack.lateral-movement
- attack.t1021.003
title: Suspicious BitLocker Access Agent Update Utility Execution
