author: '@kostastsale'
custom:
  wazuh_rule_id: 200691
date: 2023-02-02
description: 'Detects the execution of malicious OneNote documents that contain embedded
  scripts.

  When a user clicks on a OneNote attachment and then on the malicious link inside
  the ".one" file, it exports and executes the malicious embedded script from specific
  directories.

  '
detection:
  condition: selection
  selection:
    CommandLine|contains:
    - \exported\
    - \onenoteofflinecache_files\
    Image|endswith:
    - \cmd.exe
    - \cscript.exe
    - \mshta.exe
    - \powershell.exe
    - \pwsh.exe
    - \wscript.exe
    ParentImage|endswith: \onenote.exe
falsepositives:
- Unlikely
id: 84b1706c-932a-44c4-ae28-892b28a25b94
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://bazaar.abuse.ch/browse/tag/one/
status: test
tags:
- attack.stealth
- attack.t1218.001
title: OneNote.EXE Execution of Malicious Embedded Scripts
