author: Florian Roth (Nextron Systems)
custom:
  wazuh_rule_id: 200561
date: 2022-01-20
description: Detects the execution of AdvancedRun utility
detection:
  condition: selection
  selection:
  - OriginalFileName: AdvancedRun.exe
  - CommandLine|contains|all:
    - ' /EXEFilename '
    - ' /Run'
  - CommandLine|contains|all:
    - ' /WindowState 0'
    - ' /RunAs '
    - ' /CommandLine '
falsepositives:
- Unknown
id: d2b749ee-4225-417e-b20e-a8d2193cbb84
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2023-02-21
references:
- https://twitter.com/splinter_code/status/1483815103279603714
- https://medium.com/s2wblog/analysis-of-destructive-malware-whispergate-targeting-ukraine-9d5d158f19f3
- https://www.elastic.co/security-labs/operation-bleeding-bear
- https://www.winhelponline.com/blog/run-program-as-system-localsystem-account-windows/
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_pua_advancedrun/info.yml
related:
- id: fa00b701-44c6-4679-994d-5a18afa8a707
  type: similar
status: test
tags:
- attack.execution
- attack.privilege-escalation
- attack.stealth
- attack.t1564.003
- attack.t1134.002
- attack.t1059.003
title: PUA - AdvancedRun Execution
