author: Florian Roth (Nextron Systems)
custom:
  wazuh_rule_id: 200898
date: 2022-07-23
description: Detects the use of parent process ID spoofing tools like Didier Stevens
  tool SelectMyParent
detection:
  condition: selection
  selection:
  - Image|endswith: \SelectMyParent.exe
  - CommandLine|contains:
    - PPID-spoof
    - ppid_spoof
    - spoof-ppid
    - spoof_ppid
    - ppidspoof
    - spoofppid
    - spoofedppid
    - ' -spawnto '
  - OriginalFileName|contains:
    - PPID-spoof
    - ppid_spoof
    - spoof-ppid
    - spoof_ppid
    - ppidspoof
    - spoofppid
    - spoofedppid
  - Description: SelectMyParent
  - Hashes|contains:
    - IMPHASH=04D974875BD225F00902B4CAD9AF3FBC
    - IMPHASH=A782AF154C9E743DDF3F3EB2B8F3D16E
    - IMPHASH=89059503D7FBF470E68F7E63313DA3AD
    - IMPHASH=CA28337632625C8281AB8A130B3D6BAD
falsepositives:
- Unlikely
id: 52ff7941-8211-46f9-84f8-9903efb7077d
level: high
logsource:
  category: process_creation
  product: windows
modified: 2024-11-23
references:
- https://pentestlab.blog/2020/02/24/parent-pid-spoofing/
- https://www.picussecurity.com/resource/blog/how-to-detect-parent-pid-ppid-spoofing-attacks
- https://www.ired.team/offensive-security/defense-evasion/parent-process-id-ppid-spoofing
- https://www.virustotal.com/gui/search/filename%253A*spoof*%2520filename%253A*ppid*/files
status: test
tags:
- attack.privilege-escalation
- attack.stealth
- attack.t1134.004
title: HackTool - PPID Spoofing SelectMyParent Tool Execution
