author: '@Kostastsale, TheDFIRReport'
custom:
  wazuh_rule_id: 200635
date: 2022-05-09
description: Detects the execution of a specific OneLiner to download and execute
  powershell modules in memory.
detection:
  condition: selection
  selection:
    CommandLine|contains|all:
    - http://127.0.0.1
    - '%{(IRM $_)}'
    - Invoke
    Image|endswith: \powershell.exe
falsepositives:
- Unknown
id: 44e24481-6202-4c62-9127-5a0ae8e3fe3d
level: high
logsource:
  category: process_creation
  product: windows
modified: 2025-04-16
references:
- https://thedfirreport.com/2022/05/09/seo-poisoning-a-gootloader-story/
- https://gist.github.com/mgeeky/3b11169ab77a7de354f4111aa2f0df38
status: test
tags:
- attack.execution
- attack.defense-impairment
- attack.t1059.001
- attack.t1685
title: Obfuscated PowerShell OneLiner Execution
