author: frack113
custom:
  wazuh_rule_id: 201031
date: 2022-01-16
description: Deployment Image Servicing and Management tool. DISM is used to enumerate,
  install, uninstall, configure, and update features and packages in Windows images
detection:
  condition: 1 of selection_*
  selection_dism:
    CommandLine|contains|all:
    - /Online
    - /Disable-Feature
    Image|endswith: \Dism.exe
  selection_dismhost:
    Image|endswith: \DismHost.exe
    ParentCommandLine|contains|all:
    - /Online
    - /Disable-Feature
falsepositives:
- Legitimate script
id: 43e32da2-fdd0-4156-90de-50dfd62636f9
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022-08-26
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md#atomic-test-26---disable-windows-defender-with-dism
- https://www.trendmicro.com/en_us/research/22/h/ransomware-actor-abuses-genshin-impact-anti-cheat-driver-to-kill-antivirus.html
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_dism_remove/info.yml
simulation:
- atomic_guid: 871438ac-7d6e-432a-b27d-3e7db69faf58
  name: Disable Windows Defender with DISM
  technique: T1562.001
  type: atomic-red-team
status: test
tags:
- attack.defense-impairment
- attack.t1685
title: Dism Remove Online Package
