author: Beyu Denis, oscd.community, Nasreddine Bencherchali (Nextron Systems)
custom:
  wazuh_rule_id: 201011
date: 2019-10-26
description: 'Detects the execution of "DXCap.EXE" with the "-c" flag, which allows
  a user to launch any arbitrary binary or windows package through DXCap itself. This
  can be abused to potentially bypass application whitelisting.

  '
detection:
  condition: all of selection*
  selection_cli:
    CommandLine|contains: ' -c '
  selection_img:
  - Image|endswith: \DXCap.exe
  - OriginalFileName: DXCap.exe
falsepositives:
- Legitimate execution of dxcap.exe by legitimate user
id: 60f16a96-db70-42eb-8f76-16763e333590
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022-06-09
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Dxcap/
- https://twitter.com/harr0ey/status/992008180904419328
status: test
tags:
- attack.stealth
- attack.t1218
title: New Capture Session Launched Via DXCap.EXE
