author: Florian Roth (Nextron Systems)
custom:
  wazuh_rule_id: 200483
date: 2021-01-28
description: Detects commands that temporarily turn off Volume Snapshots
detection:
  condition: selection
  selection:
    CommandLine|contains|all:
    - \Services\VSS\Diag
    - /d Disabled
falsepositives:
- Legitimate administration
id: dee4af55-1f22-4e1d-a9d2-4bdc7ecb472a
level: high
logsource:
  category: process_creation
  product: windows
modified: 2023-12-15
references:
- https://twitter.com/0gtweet/status/1354766164166115331
status: test
tags:
- attack.defense-impairment
- attack.t1685
title: Disabled Volume Snapshots
