author: Victor Sergeev, oscd.community
custom:
  wazuh_rule_id: 200106
date: 2020-10-09
description: Detects when verclsid.exe is used to run COM object via GUID
detection:
  condition: all of selection_* and not 1 of filter_main_*
  filter_main_runtimebroker:
    CommandLine|contains|all:
    - verclsid.exe" /S /C {
    - '} /I {'
    ParentImage|endswith: C:\Windows\System32\RuntimeBroker.exe
  selection_cli:
    CommandLine|contains|all:
    - /S
    - /C
  selection_img:
  - Image|endswith: \verclsid.exe
  - OriginalFileName: verclsid.exe
falsepositives:
- Unknown
id: d06be4b9-8045-428b-a567-740a26d9db25
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2025-10-07
references:
- https://lolbas-project.github.io/lolbas/Binaries/Verclsid/
- https://gist.github.com/NickTyrer/0598b60112eaafe6d07789f7964290d5
- https://bohops.com/2018/08/18/abusing-the-com-registry-structure-part-2-loading-techniques-for-evasion-and-persistence/
status: test
tags:
- attack.stealth
- attack.t1218
title: Verclsid.exe Runs COM Object
