author: Florian Roth (Nextron Systems)
custom:
  wazuh_rule_id: 200370
date: 2017-04-15
description: Detects suspicious Rundll32 execution from control.exe as used by Equation
  Group and Exploit Kits
detection:
  condition: all of selection_* and not filter
  filter:
    CommandLine|contains: Shell32.dll
  selection_img:
  - Image|endswith: \rundll32.exe
  - OriginalFileName: RUNDLL32.EXE
  selection_parent:
    ParentImage|endswith: \System32\control.exe
falsepositives:
- Unknown
id: d7eb979b-c2b5-4a6f-a3a7-c87ce6763819
level: high
logsource:
  category: process_creation
  product: windows
modified: 2023-02-09
references:
- https://twitter.com/rikvduijn/status/853251879320662017
- https://twitter.com/felixw3000/status/853354851128025088
status: test
tags:
- attack.stealth
- attack.t1218.011
title: Suspicious Control Panel DLL Load
