author: yxinmiracle
custom:
  wazuh_rule_id: 200582
date: 2025-08-22
description: 'Detects the use of PowerShell with Uninstall-WindowsFeature or Remove-WindowsFeature
  cmdlets to disable or remove the Windows Defender GUI feature, a common technique
  used by adversaries to evade defenses.

  '
detection:
  condition: all of selection_*
  selection_cli_defender_feature:
    CommandLine|contains: Windows-Defender
  selection_cli_uninstall:
    CommandLine|contains:
    - Uninstall-WindowsFeature
    - Remove-WindowsFeature
  selection_img:
  - Image|endswith:
    - \powershell_ise.exe
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - PowerShell_ISE.EXE
    - PowerShell.EXE
    - pwsh.dll
falsepositives:
- Unknown
id: c443012c-7928-43bf-ac20-7eda5efe61ad
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://learn.microsoft.com/en-us/powershell/module/microsoft.windows.servermanager.migration/uninstall-windowsfeature
- https://thedfirreport.com/2023/04/03/malicious-iso-file-leads-to-domain-wide-ransomware
status: experimental
tags:
- attack.defense-impairment
- attack.t1685
title: Suspicious Uninstall of Windows Defender Feature via PowerShell
