author: sam0x90
custom:
  wazuh_rule_id: 201010
date: 2021-08-06
description: Conti recommendation to its affiliates to use esentutl to access NTDS
  dumped file. Trickbot also uses this utilities to get MSEdge info via its module
  pwgrab.
detection:
  condition: selection
  selection:
    CommandLine|contains|all:
    - esentutl
    - ' /p'
falsepositives:
- To be determined
id: 7df1713a-1a5b-4a4b-a071-dc83b144a101
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022-10-09
references:
- https://twitter.com/vxunderground/status/1423336151860002816
- https://thedfirreport.com/2021/08/01/bazarcall-to-conti-ransomware-via-trickbot-and-cobalt-strike/
status: test
tags:
- attack.credential-access
- attack.t1003
- attack.t1003.003
- attack.s0404
title: Esentutl Gather Credentials
