author: Florian Roth (Nextron Systems)
custom:
  wazuh_rule_id: 200366
date: 2021-02-01
description: Detects actions that clear the local ShimCache and remove forensic evidence
detection:
  condition: ( selection1a and selection1b ) or ( selection2a and selection2b )
  selection1a:
    CommandLine|contains|all:
    - rundll32
    - apphelp.dll
  selection1b:
    CommandLine|contains:
    - ShimFlushCache
    - '#250'
  selection2a:
    CommandLine|contains|all:
    - rundll32
    - kernel32.dll
  selection2b:
    CommandLine|contains:
    - BaseFlushAppcompatCache
    - '#46'
falsepositives:
- Unknown
id: b0524451-19af-4efa-a46f-562a977f792e
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://medium.com/@blueteamops/shimcache-flush-89daff28d15e
status: stable
tags:
- attack.persistence
- attack.defense-impairment
- attack.t1112
title: ShimCache Flush
