author: Florian Roth (Nextron Systems)
custom:
  wazuh_rule_id: 200937
date: 2022-08-18
description: Detects the use of HandleKatz, a tool that demonstrates the usage of
  cloned handles to Lsass in order to create an obfuscated memory dump of the same
detection:
  condition: 1 of selection_*
  selection_flags:
    CommandLine|contains:
    - .dmp
    - lsass
    - .obf
    - dump
    CommandLine|contains|all:
    - '--pid:'
    - '--outfile:'
  selection_loader_img:
    CommandLine|contains: '--pid:'
    Image|endswith: \loader.exe
  selection_loader_imphash:
    Hashes|contains:
    - IMPHASH=38D9E015591BBFD4929E0D0F47FA0055
    - IMPHASH=0E2216679CA6E1094D63322E3412D650
falsepositives:
- Unknown
id: ca621ba5-54ab-4035-9942-d378e6fcde3c
level: high
logsource:
  category: process_creation
  product: windows
modified: 2024-11-23
references:
- https://github.com/codewhitesec/HandleKatz
status: test
tags:
- attack.credential-access
- attack.t1003.001
title: HackTool - HandleKatz LSASS Dumper Execution
