author: Beyu Denis, oscd.community
custom:
  wazuh_rule_id: 201023
date: 2020-10-18
description: Detects execution of arbitrary DLLs or unsigned code via a ".csproj"
  files via Dotnet.EXE.
detection:
  condition: all of selection_* and not 1 of filter_optional_*
  filter_optional_notepadplus_plus:
    CommandLine|contains|all:
    - C:\ProgramData\CSScriptNpp\
    - '-cscs_path:'
    - \cs-script\cscs.dll
    ParentImage:
    - C:\Program Files (x86)\Notepad++\notepad++.exe
    - C:\Program Files\Notepad++\notepad++.exe
  selection_cli:
    CommandLine|endswith:
    - .csproj
    - .csproj"
    - .dll
    - .dll"
    - .csproj'
    - .dll'
  selection_img:
  - Image|endswith: \dotnet.exe
  - OriginalFileName: .NET Host
falsepositives:
- Legitimate administrator usage
id: d80d5c81-04ba-45b4-84e4-92eba40e0ad3
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2025-10-08
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Dotnet/
- https://twitter.com/_felamos/status/1204705548668555264
- https://bohops.com/2019/08/19/dotnet-core-a-vector-for-awl-bypass-defense-evasion/
status: test
tags:
- attack.stealth
- attack.t1218
title: Arbitrary DLL or Csproj Code Execution Via Dotnet.EXE
