author: Nasreddine Bencherchali (Nextron Systems), kagebunsher
custom:
  wazuh_rule_id: 200234
date: 2022-10-25
description: 'Detects potentially suspicious search for JWT tokens via CLI by looking
  for the string "eyJ0eX" or "eyJhbG".

  JWT tokens are often used for access-tokens across various applications and services
  like Microsoft 365, Azure, AWS, Google Cloud, and others.

  Threat actors may search for these tokens to steal them for lateral movement or
  privilege escalation.

  '
detection:
  condition: all of selection_*
  selection_jwt_string:
    CommandLine|contains:
    - eyJ0eXAiOi
    - eyJhbGciOi
    - ' eyJ0eX'
    - ' "eyJ0eX"'
    - ' ''eyJ0eX'''
    - ' eyJhbG'
    - ' "eyJhbG"'
    - ' ''eyJhbG'''
  selection_tools:
    CommandLine|contains:
    - 'find '
    - find.exe
    - findstr
    - 'select-string '
    - strings
falsepositives:
- Unknown
id: 6d3a3952-6530-44a3-8554-cf17c116c615
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2025-10-21
references:
- https://mrd0x.com/stealing-tokens-from-office-applications/
- https://www.scip.ch/en/?labs.20240523
status: test
tags:
- attack.credential-access
- attack.t1528
- attack.t1552.001
title: Potentially Suspicious JWT Token Search Via CLI
