author: frack113
custom:
  wazuh_rule_id: 200811
date: 2022-05-02
description: Detects the execution of the LOLBIN PrintBrm.exe, which can be used to
  create or extract ZIP files. PrintBrm.exe should not be run on a normal workstation.
detection:
  condition: selection
  selection:
    CommandLine|contains|all:
    - ' -f'
    - .zip
    Image|endswith: \PrintBrm.exe
falsepositives:
- Unknown
id: cafeeba3-01da-4ab4-b6c4-a31b1d9730c7
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/PrintBrm/
status: test
tags:
- attack.command-and-control
- attack.stealth
- attack.t1105
- attack.t1564.004
title: PrintBrm ZIP Creation of Extraction
