author: '@kostastsale'
custom:
  wazuh_rule_id: 200364
date: 2024-08-16
description: 'Detects the execution of rundll32.exe with the oledb32.dll library to
  open a UDL file.

  Threat actors can abuse this technique as a phishing vector to capture authentication
  credentials or other sensitive data.

  '
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains|all:
    - oledb32.dll
    - ',OpenDSLFile '
    - \\Users\\*\\Downloads\\
    CommandLine|endswith: .udl
  selection_img:
  - Image|endswith: \rundll32.exe
  - OriginalFileName: RUNDLL32.EXE
  selection_parent:
    ParentImage|endswith: \explorer.exe
falsepositives:
- UDL files serve as a convenient and flexible tool for managing and testing database
  connections in various development and administrative scenarios.
id: 0ea52357-cd59-4340-9981-c46c7e900428
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://trustedsec.com/blog/oops-i-udld-it-again
status: test
tags:
- attack.execution
- attack.command-and-control
- attack.stealth
- attack.t1218.011
- attack.t1071
title: Potentially Suspicious Rundll32.EXE Execution of UDL File
