author: Markus Neis, @Kostastsale
custom:
  wazuh_rule_id: 200669
date: 2018-08-17
description: Detects Request to "amsiInitFailed" that can be used to disable AMSI
  Scanning
detection:
  condition: selection
  selection:
  - CommandLine|contains|all:
    - System.Management.Automation.AmsiUtils
    - amsiInitFailed
  - CommandLine|contains|all:
    - '[Ref].Assembly.GetType'
    - SetValue($null,$true)
    - NonPublic,Static
falsepositives:
- Unlikely
id: 30edb182-aa75-42c0-b0a9-e998bb29067c
level: high
logsource:
  category: process_creation
  product: windows
modified: 2023-02-03
references:
- https://s3cur3th1ssh1t.github.io/Bypass_AMSI_by_manual_modification/
- https://www.mdsec.co.uk/2018/06/exploring-powershell-amsi-and-logging-evasion/
related:
- id: 4f927692-68b5-4267-871b-073c45f4f6fe
  type: obsolete
status: test
tags:
- attack.defense-impairment
- attack.t1685
title: Potential AMSI Bypass Via .NET Reflection
