author: Swachchhanda Shrawan Poudel (Nextron Systems)
custom:
  wazuh_rule_id: 200544
date: 2025-02-05
description: 'Detects usage of NimScan, a portscanner utility.

  In early 2025, adversaries were observed using this utility to scan for open ports
  on remote hosts in a compromised environment.

  This rule identifies the execution of NimScan based on the process image name and
  specific hash values associated with different versions of the tool.

  '
detection:
  condition: selection
  selection:
  - Image|endswith: \NimScan.exe
  - Hashes|contains:
    - IMPHASH=41BB1C7571B3A724EB83A1D2B96DBB8C
    - IMPHASH=B1B6ADACB172795480179EFD18A29549
    - IMPHASH=0D1F896DC7642AD8384F9042F30279C2
falsepositives:
- Legitimate administrator activity
id: 4fd6b1c7-19b8-4488-97f6-00f0924991a3
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://x.com/cyberfeeddigest/status/1887041526397587859
- https://github.com/elddy/NimScan
status: test
tags:
- attack.discovery
- attack.t1046
title: PUA - NimScan Execution
