author: '@Kostastsale'
custom:
  wazuh_rule_id: 200439
date: 2024-09-22
description: 'Detects the use of MeshAgent to execute commands on the target host,
  particularly when threat actors might abuse it to execute commands directly.

  MeshAgent can execute commands on the target host by leveraging win-console to obscure
  their activities and win-dispatcher to run malicious code through IPC with child
  processes.

  '
detection:
  condition: selection
  selection:
    Image|endswith:
    - \cmd.exe
    - \powershell.exe
    - \pwsh.exe
    ParentImage|endswith: \meshagent.exe
falsepositives:
- False positives can be found in environments using MeshAgent for remote management,
  analysis should prioritize the grandparent process, MeshAgent.exe, and scrutinize
  the resulting child processes triggered by any suspicious interactive commands directed
  at the target host.
id: 74a2b202-73e0-4693-9a3a-9d36146d0775
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/Ylianst/MeshAgent
- https://github.com/Ylianst/MeshAgent/blob/52cf129ca43d64743181fbaf940e0b4ddb542a37/modules/win-dispatcher.js#L173
- https://github.com/Ylianst/MeshAgent/blob/52cf129ca43d64743181fbaf940e0b4ddb542a37/modules/win-info.js#L55
status: test
tags:
- attack.command-and-control
- attack.t1219.002
title: Remote Access Tool - MeshAgent Command Execution via MeshCentral
