author: Florian Roth (Nextron Systems)
custom:
  wazuh_rule_id: 200118
date: 2021-08-27
description: Detects indicators of a UAC bypass method by mocking directories
detection:
  condition: selection
  selection:
    Image|contains:
    - C:\Windows \System32\
    - C:\Windows \SysWOW64\
falsepositives:
- Unknown
id: 4ac47ed3-44c2-4b1f-9d51-bf46e8914126
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2025-06-17
references:
- https://medium.com/tenable-techblog/uac-bypass-by-mocking-trusted-directories-24a96675f6e
- https://www.wietzebeukema.nl/blog/hijacking-dlls-in-windows
- https://github.com/netero1010/TrustedPath-UACBypass-BOF
- https://x.com/Wietze/status/1933495426952421843
related:
- id: 0cbe38c0-270c-41d9-ab79-6e5a9a669290
  type: similar
status: test
tags:
- attack.privilege-escalation
- attack.t1548.002
title: TrustedPath UAC Bypass Pattern
