author: Chirag Damani
custom:
  wazuh_rule_id: 200910
date: 2026-03-29
description: 'Detects execution of the hacktool NetExec.

  NetExec (formerly CrackMapExec) is a widely used post-exploitation tool designed
  for Active Directory penetration testing and network enumeration

  In enterprise environments, the use of NetExec is considered suspicious or potentially
  malicious because it enables attackers to enumerate hosts, exploit network services,
  and move laterally across systems.

  Threat actors and red teams commonly use NetExec to identify vulnerable systems,
  harvest credentials, and execute commands remotely.

  '
detection:
  condition: selection
  selection:
    CommandLine|contains:
    - ' ftp '
    - ' ldap '
    - ' mssql '
    - ' nfs '
    - ' rdp '
    - ' smb '
    - ' ssh '
    - ' vnc '
    - ' winrm '
    - ' wmi '
    Image|endswith: \nxc.exe
falsepositives:
- Legitimate use of NetExec by security professionals or system administrators for
  network assessment and management.
id: 7638e5fe-600c-4289-a968-f49dd537ec7d
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://thedfirreport.com/2025/12/17/cats-got-your-files-lynx-ransomware/
- https://github.com/Pennyw0rth/NetExec
- https://www.netexec.wiki/
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_hktl_netexec/info.yml
status: experimental
tags:
- attack.discovery
- attack.t1018
- attack.lateral-movement
- attack.t1021
title: HackTool - NetExec Execution
