author: Nasreddine Bencherchali (Nextron Systems)
custom:
  wazuh_rule_id: 200938
date: 2022-10-05
description: Detects the execution GMER tool based on image and hash fields.
detection:
  condition: 1 of selection_*
  selection_img:
    Image|endswith: \gmer.exe
  selection_sysmon_hash:
    Hashes|contains:
    - MD5=E9DC058440D321AA17D0600B3CA0AB04
    - SHA1=539C228B6B332F5AA523E5CE358C16647D8BBE57
    - SHA256=E8A3E804A96C716A3E9B69195DB6FFB0D33E2433AF871E4D4E1EAB3097237173
falsepositives:
- Unlikely
id: 9082ff1f-88ab-4678-a3cc-5bcff99fc74d
level: high
logsource:
  category: process_creation
  product: windows
modified: 2024-11-23
references:
- http://www.gmer.net/
status: test
tags:
- attack.stealth
title: HackTool - GMER Rootkit Detector and Remover Execution
