author: '@kostastsale'
custom:
  wazuh_rule_id: 200883
date: 2024-01-26
description: 'Detects the execution of SOAPHound, a .NET tool for collecting Active
  Directory data, using specific command-line arguments that may indicate an attempt
  to extract sensitive AD information.

  '
detection:
  condition: all of selection_*
  selection_1:
    CommandLine|contains:
    - ' --buildcache '
    - ' --bhdump '
    - ' --certdump '
    - ' --dnsdump '
  selection_2:
    CommandLine|contains:
    - ' -c '
    - ' --cachefilename '
    - ' -o '
    - ' --outputdirectory'
falsepositives:
- Unknown
id: e92a4287-e072-4a40-9739-370c106bb750
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/FalconForceTeam/SOAPHound
- https://medium.com/falconforce/soaphound-tool-to-collect-active-directory-data-via-adws-165aca78288c
status: test
tags:
- attack.discovery
- attack.t1087
title: HackTool - SOAPHound Execution
