author: Victor Sergeev, oscd.community
custom:
  wazuh_rule_id: 200413
date: 2020-10-09
description: Detects the execution of a renamed "ftp.exe" binary based on the PE metadata
  fields
detection:
  condition: selection_original and not filter_img
  filter_img:
    Image|endswith: \ftp.exe
  selection_original:
    OriginalFileName: ftp.exe
falsepositives:
- Unknown
id: 277a4393-446c-449a-b0ed-7fdc7795244c
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2023-02-03
references:
- https://lolbas-project.github.io/lolbas/Binaries/Ftp/
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_renamed_ftp/info.yml
status: test
tags:
- attack.execution
- attack.stealth
- attack.t1059
- attack.t1202
title: Renamed FTP.EXE Execution
