author: Ivan Dyachkov, Yulia Fomina, oscd.community
custom:
  wazuh_rule_id: 200470
date: 2020-10-07
description: Detects using register-cimprovider.exe to execute arbitrary dll file.
detection:
  condition: selection
  selection:
    CommandLine|contains|all:
    - -path
    - dll
    Image|endswith: \register-cimprovider.exe
falsepositives:
- Unknown
id: a2910908-e86f-4687-aeba-76a5f996e652
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021-11-27
references:
- https://twitter.com/PhilipTsukerman/status/992021361106268161
- https://lolbas-project.github.io/lolbas/Binaries/Register-cimprovider/
status: test
tags:
- attack.privilege-escalation
- attack.persistence
- attack.execution
- attack.stealth
- attack.t1574
title: DLL Execution Via Register-cimprovider.exe
