author: Joseliyo Sanchez, @Joseliyo_Jstnk
custom:
  wazuh_rule_id: 200272
date: 2025-11-12
description: 'Detects suspicious usage of the cmd.exe ''for /f'' loop combined with
  the ''tokens='' parameter and a recursive directory listing.

  This pattern may indicate an attempt to discover and execute system binaries dynamically,
  for example powershell, a technique sometimes used by attackers to evade detection.

  This behavior has been observed in various malicious lnk files.

  '
detection:
  condition: 1 of selection_*
  selection_tokens:
    CommandLine|contains|all:
    - for /f
    - tokens=
    - in (
    - dir
  selection_tokens_parent:
    ParentCommandLine|contains|all:
    - for /f
    - tokens=
    - in (
    - dir
falsepositives:
- Unknown
id: 2782fbd8-b662-4eb5-9962-5bfbfb671e7b
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://www.virustotal.com/gui/file/29837d0d3202758063185828c8f8d9e0b7b42b365c8941cc926d2d7c7bae2fb3
status: experimental
tags:
- attack.execution
- attack.stealth
- attack.t1059.003
- attack.t1027.010
title: Suspicious Usage of For Loop with Recursive Directory Search in CMD
