author: Florian Roth (Nextron Systems)
custom:
  wazuh_rule_id: 200605
date: 2020-07-09
description: Detects suspicious encoded character syntax often used for defense evasion
detection:
  condition: selection
  selection:
    CommandLine|contains:
    - '[char]0x'
    - (WCHAR)0x
falsepositives:
- Unknown
id: e312efd0-35a1-407f-8439-b8d434b438a6
level: high
logsource:
  category: process_creation
  product: windows
modified: 2025-03-03
references:
- https://twitter.com/0gtweet/status/1281103918693482496
status: test
tags:
- attack.execution
- attack.stealth
- attack.t1059.001
- attack.t1027
title: Potential PowerShell Obfuscation Via WCHAR/CHAR
