author: X__Junior (Nextron Systems)
custom:
  wazuh_rule_id: 200718
date: 2023-07-18
description: Detects execution of netsh with the "advfirewall" and the "set" option
  in order to set new values for properties of a existing rule
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains|all:
    - ' firewall '
    - ' set '
  selection_img:
  - Image|endswith: \netsh.exe
  - OriginalFileName: netsh.exe
falsepositives:
- Legitimate administration activity
- Software installations and removal
id: a70dcb37-3bee-453a-99df-d0c683151be6
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://ss64.com/nt/netsh.html
status: test
tags:
- attack.defense-impairment
title: Firewall Rule Update Via Netsh.EXE
