author: Nasreddine Bencherchali (Nextron Systems)
custom:
  wazuh_rule_id: 200004
date: 2022-08-05
description: 'Detects the execution of the "wusa.exe" (Windows Update Standalone Installer)
  utility to extract ".cab" files using the "/extract" argument from potentially suspicious
  paths.

  '
detection:
  condition: all of selection_*
  selection_paths:
    CommandLine|contains:
    - :\PerfLogs\
    - :\Users\Public\
    - :\Windows\Temp\
    - \Appdata\Local\Temp\
  selection_root:
    CommandLine|contains: '/extract:'
    Image|endswith: \wusa.exe
falsepositives:
- Unknown
id: c74c0390-3e20-41fd-a69a-128f0275a5ea
level: high
logsource:
  category: process_creation
  product: windows
modified: 2023-11-28
references:
- https://web.archive.org/web/20180331144337/https://www.fireeye.com/blog/threat-research/2018/03/sanny-malware-delivery-method-updated-in-recently-observed-attacks.html
- https://www.echotrail.io/insights/search/wusa.exe/
related:
- id: 59b39960-5f9d-4a49-9cef-1e4d2c1d0cb9
  type: derived
status: test
tags:
- attack.execution
title: Cab File Extraction Via Wusa.EXE From Potentially Suspicious Paths
