author: Nasreddine Bencherchali
custom:
  wazuh_rule_id: 200035
date: 2023-02-14
description: Detects the execution of WMIC in order to get a list of firewall and
  antivirus products
detection:
  condition: all of selection_* and not 1 of filter_main_*
  filter_main_call_operations:
    CommandLine|contains:
    - ' uninstall'
    - ' install'
  filter_main_csproduct:
    CommandLine|contains: csproduct
  selection_cli:
    CommandLine|contains: Product
  selection_img:
  - Image|endswith: \wmic.exe
  - OriginalFileName: wmic.exe
falsepositives:
- Unknown
id: 15434e33-5027-4914-88d5-3d4145ec25a9
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2025-12-15
references:
- https://thedfirreport.com/2023/03/06/2022-year-in-review/
- https://www.yeahhub.com/list-installed-programs-version-path-windows/
- https://learn.microsoft.com/en-us/answers/questions/253555/software-list-inventory-wmic-product
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_wmic_recon_product/info.yml
status: test
tags:
- attack.execution
- attack.t1047
title: Potential Product Reconnaissance Via Wmic.EXE
