author: Christian Burkard (Nextron Systems)
custom:
  wazuh_rule_id: 200129
date: 2021-08-30
description: Detects the pattern of UAC Bypass using DismHost DLL hijacking (UACMe
  63)
detection:
  condition: selection
  selection:
    IntegrityLevel:
    - High
    - System
    - S-1-16-16384
    - S-1-16-12288
    ParentImage|contains|all:
    - C:\Users\
    - \AppData\Local\Temp\
    - \DismHost.exe
falsepositives:
- Unknown
id: 853e74f9-9392-4935-ad3b-2e8c040dae86
level: high
logsource:
  category: process_creation
  product: windows
modified: 2024-12-01
references:
- https://github.com/hfiref0x/UACME
status: test
tags:
- attack.privilege-escalation
- attack.t1548.002
title: UAC Bypass Using DismHost
