author: A. Sungurov , oscd.community
custom:
  wazuh_rule_id: 200816
date: 2020-10-12
description: Detect indirect command execution via Program Compatibility Assistant
  pcwrun.exe
detection:
  condition: selection
  selection:
    ParentImage|endswith: \pcwrun.exe
falsepositives:
- Need to use extra processing with 'unique_count' / 'filter' to focus on outliers
  as opposed to commonly seen artifacts
- Legit usage of scripts
id: b97cd4b1-30b8-4a9d-bd72-6293928d52bc
level: low
logsource:
  category: process_creation
  product: windows
modified: 2021-11-27
references:
- https://twitter.com/pabraeken/status/991335019833708544
- https://lolbas-project.github.io/lolbas/Binaries/Pcwrun/
status: test
tags:
- attack.stealth
- attack.t1218
- attack.execution
title: Indirect Command Execution By Program Compatibility Wizard
