author: Nasreddine Bencherchali (Nextron Systems)
custom:
  wazuh_rule_id: 200368
date: 2022-09-01
description: Detects suspicious usage of the ShellExec_RunDLL function to launch other
  commands as seen in the the raspberry-robin attack
detection:
  condition: all of selection_*
  selection_openasrundll:
    CommandLine|contains: ShellExec_RunDLL
  selection_suspcli:
    CommandLine|contains:
    - \Desktop\
    - \Temp\
    - \Users\Public\
    - comspec
    - iex
    - Invoke-
    - msiexec
    - odbcconf
    - regsvr32
falsepositives:
- Unknown
id: d87bd452-6da1-456e-8155-7dc988157b7d
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022-12-30
references:
- https://redcanary.com/blog/raspberry-robin/
- https://www.microsoft.com/en-us/security/blog/2022/10/27/raspberry-robin-worm-part-of-larger-ecosystem-facilitating-pre-ransomware-activity/
- https://github.com/SigmaHQ/sigma/issues/1009
related:
- id: 36c5146c-d127-4f85-8e21-01bf62355d5a
  type: obsolete
- id: 8823e85d-31d8-473e-b7f4-92da070f0fc6
  type: similar
status: test
tags:
- attack.stealth
title: Suspicious Usage Of ShellExec_RunDLL
