author: Nounou Mbeiri, Swachchhanda Shrawan Poudel (Nextron Systems)
custom:
  wazuh_rule_id: 200532
date: 2025-10-17
description: 'Detects the execution of the Restic backup tool, which can be used for
  data exfiltration.

  Threat actors may leverage Restic to back up and exfiltrate sensitive data to remote
  storage locations, including cloud services.

  If not legitimately used in the enterprise environment, its presence may indicate
  malicious activity.

  '
detection:
  condition: 1 of selection_*
  selection_restic:
    CommandLine|contains:
    - 'sftp:'
    - rest:http
    - s3:s3.
    - s3.http
    - 'azure:'
    - ' gs:'
    - 'rclone:'
    - 'swift:'
    - ' b2:'
    CommandLine|contains|all:
    - ' init '
    - ' -r '
  selection_specific:
  - CommandLine|contains|all:
    - --password-file
    - init
    - ' -r '
  - CommandLine|contains|all:
    - --use-fs-snapshot
    - backup
    - ' -r '
falsepositives:
- Legitimate use of Restic for backup purposes within the organization.
id: 6ddff2e8-ea1a-45d0-8938-93dfc1d67ae7
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://thedfirreport.com/2024/09/30/nitrogen-campaign-drops-sliver-and-ends-with-blackcat-ransomware/#exfiltration
- https://restic.net/
- https://restic.readthedocs.io/en/stable/030_preparing_a_new_repo.html
status: experimental
tags:
- attack.exfiltration
- attack.t1048
- attack.t1567.002
title: PUA - Restic Backup Tool Execution
