author: Florian Roth (Nextron Systems), Jonhnathan Ribeiro, oscd.community
custom:
  wazuh_rule_id: 201125
date: 2023-02-15
description: Detects the execution of certutil with either the "decode" or "decodehex"
  flags to decode base64 or hex encoded files. This can be abused by attackers to
  decode an encoded payload before execution
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains|windash:
    - '-decode '
    - '-decodehex '
  selection_img:
  - Image|endswith: \certutil.exe
  - OriginalFileName: CertUtil.exe
falsepositives:
- Unknown
id: cc9cbe82-7bc0-4ef5-bc23-bbfb83947be7
level: high
logsource:
  category: process_creation
  product: windows
modified: 2025-06-04
references:
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/certutil
- https://unit42.paloaltonetworks.com/new-babyshark-malware-targets-u-s-national-security-think-tanks/
- https://news.sophos.com/en-us/2021/04/13/compromised-exchange-server-hosting-cryptojacker-targeting-other-exchange-servers/
- https://twitter.com/JohnLaTwC/status/835149808817991680
- https://learn.microsoft.com/en-us/archive/blogs/pki/basic-crl-checking-with-certutil
- https://lolbas-project.github.io/lolbas/Binaries/Certutil/
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_certutil_decode/info.yml
status: test
tags:
- attack.stealth
- attack.t1027
title: File Decoded From Base64/Hex Via Certutil.EXE
