author: frack113, Florian Roth (Nextron Systems), Josh Nickels
custom:
  wazuh_rule_id: 200275
date: 2024-09-02
description: 'Detects potential commandline obfuscation using unicode characters.

  Adversaries may attempt to make an executable or file difficult to discover or analyze
  by encrypting, encoding, or otherwise obfuscating its contents on the system or
  in transit.

  '
detection:
  condition: all of selection_*
  selection_img:
    Image|endswith:
    - \cmd.exe
    - \cscript.exe
    - \powershell.exe
    - \powershell_ise.exe
    - \pwsh.exe
    - \wscript.exe
    OriginalFileName:
    - Cmd.EXE
    - cscript.exe
    - PowerShell.EXE
    - PowerShell_ISE.EXE
    - pwsh.dll
    - wscript.exe
  selection_special_chars:
    CommandLine|contains:
    - "\u02E3"
    - "\u02EA"
    - "\u02E2"
    - "\u2215"
    - "\u2044"
    - "\u2015"
    - "\u2014"
    - "\_"
    - "\xAF"
    - "\xAE"
    - "\xB6"
    - "\u2800"
falsepositives:
- Unknown
id: 584bca0f-3608-4402-80fd-4075ff6072e3
level: high
logsource:
  category: process_creation
  product: windows
modified: 2025-05-30
references:
- https://www.wietzebeukema.nl/blog/windows-command-line-obfuscation
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1027/T1027.md#atomic-test-6---dlp-evasion-via-sensitive-data-in-vba-macro-over-http
related:
- id: e0552b19-5a83-4222-b141-b36184bb8d79
  type: similar
- id: ad691d92-15f2-4181-9aa4-723c74f9ddc3
  type: similar
- id: 2c0d2d7b-30d6-4d14-9751-7b9113042ab9
  type: obsolete
status: test
tags:
- attack.stealth
- attack.t1027
title: Potential CommandLine Obfuscation Using Unicode Characters From Suspicious
  Image
