author: Swachchhanda Shrawan Poudel (Nextron Systems)
custom:
  wazuh_rule_id: 200397
date: 2025-11-27
description: 'Detects the execution of renamed schtasks.exe binary, which is a legitimate
  Windows utility used for scheduling tasks.

  One of the very common persistence techniques is schedule malicious tasks using
  schtasks.exe.

  Since, it is heavily abused, it is also heavily monitored by security products.
  To evade detection, threat actors may rename the schtasks.exe binary to schedule
  their malicious tasks.

  '
detection:
  condition: (all of selection_cmd_* and not filter_main_cmd) or (selection_pe and
    not filter_main_img)
  filter_main_cmd:
    CommandLine|contains: schtasks
  filter_main_img:
    Image|endswith: \schtasks.exe
  selection_cmd_flags:
    CommandLine|contains|windash:
    - ' /tn '
    - ' /tr '
    - ' /sc '
    - ' /st '
    - ' /ru '
    - ' /fo '
  selection_cmd_operation:
    CommandLine|contains|windash:
    - ' /create '
    - ' /delete '
    - ' /query '
    - ' /change '
    - ' /run '
    - ' /end '
  selection_pe:
    OriginalFileName: schtasks.exe
falsepositives:
- Unlikely
id: f91e51c9-f344-4b32-969b-0b6f6b8537d4
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://x.com/JangPr0/status/1932034543026065833
- https://ss64.com/nt/schtasks.html
status: experimental
tags:
- attack.execution
- attack.persistence
- attack.privilege-escalation
- attack.stealth
- attack.t1036.003
- attack.t1053.005
title: Renamed Schtasks Execution
