author: '@juju4'
custom:
  wazuh_rule_id: 200136
date: 2022-12-27
description: Detects potential RDP Session Hijacking activity on Windows systems
detection:
  condition: all of selection_*
  selection_img:
  - Image|endswith: \tscon.exe
  - OriginalFileName: tscon.exe
  selection_integrity:
    IntegrityLevel:
    - System
    - S-1-16-16384
falsepositives:
- Administrative activity
id: 224f140f-3553-4cd1-af78-13d81bf9f7cc
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2024-12-01
references:
- https://twitter.com/Moti_B/status/909449115477659651
status: test
tags:
- attack.execution
title: Potential RDP Session Hijacking Activity
