author: X__Junior (Nextron Systems)
custom:
  wazuh_rule_id: 200415
date: 2023-09-11
description: Detects the execution of a renamed "CURL.exe" binary based on the PE
  metadata fields
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_img:
    Image|contains: \curl
  selection:
  - OriginalFileName: curl.exe
  - Description: The curl executable
falsepositives:
- Unknown
id: 7530cd3d-7671-43e3-b209-976966f6ea48
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2023-10-12
references:
- https://twitter.com/Kostastsale/status/1700965142828290260
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_renamed_curl/info.yml
status: test
tags:
- attack.execution
- attack.stealth
- attack.t1059
- attack.t1202
title: Renamed CURL.EXE Execution
