author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
custom:
  wazuh_rule_id: 201137
date: 2022-01-11
description: Detects execution of a browser process with a URL argument pointing to
  a file with a potentially interesting extension. This can be abused to download
  arbitrary files or to hide from the user for example by launching the browser in
  a minimized state.
detection:
  condition: all of selection_*
  selection_extensions:
  - CommandLine|endswith:
    - .7z
    - .dat
    - .dll
    - .exe
    - .hta
    - .ps1
    - .psm1
    - .txt
    - .vbe
    - .vbs
    - .zip
  - CommandLine|contains:
    - .7z"
    - .dat"
    - .dll"
    - .hta"
    - .ps1"
    - .psm1"
    - .txt"
    - .vbe"
    - .vbs"
    - .zip"
  selection_http:
    CommandLine|contains: http
  selection_img:
    Image|endswith:
    - \brave.exe
    - \chrome.exe
    - \msedge.exe
    - \opera.exe
    - \vivaldi.exe
falsepositives:
- Unknown
id: 94771a71-ba41-4b6e-a757-b531372eaab6
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2025-10-27
references:
- https://twitter.com/mrd0x/status/1478116126005641220
- https://lolbas-project.github.io/lolbas/Binaries/Msedge/
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_browsers_inline_file_download/info.yml
status: test
tags:
- attack.command-and-control
- attack.t1105
title: File Download From Browser Process Via Inline URL
