author: Florian Roth (Nextron Systems)
custom:
  wazuh_rule_id: 200619
date: 2021-04-23
description: Detects a "Get-Process" cmdlet and it's aliases on lsass process, which
  is in almost all cases a sign of malicious activity
detection:
  condition: selection
  selection:
    CommandLine|contains:
    - Get-Process lsas
    - ps lsas
    - gps lsas
falsepositives:
- Unknown
id: b2815d0d-7481-4bf0-9b6c-a4c48a94b349
level: high
logsource:
  category: process_creation
  product: windows
modified: 2023-01-05
references:
- https://web.archive.org/web/20220205033028/https://twitter.com/PythonResponder/status/1385064506049630211
status: test
tags:
- attack.credential-access
- attack.t1552.004
title: PowerShell Get-Process LSASS
