author: Matt Anderson, Dray Agha, Anna Pham (Huntress)
custom:
  wazuh_rule_id: 201042
date: 2026-01-02
description: 'Detects execution of devcon.exe with commands that disable the VMware
  Virtual Machine Communication Interface (VMCI) device.

  This can be legitimate during VMware Tools troubleshooting or driver conflicts,
  but may also indicate malware attempting to hijack communication with the hardware
  via the VMCI device.

  This has been used to facilitate VMware ESXi vulnerability exploits to escape VMs
  and execute code on the ESXi host.

  '
detection:
  condition: all of selection_*
  selection_action:
    CommandLine|contains: ' disable '
  selection_img:
  - Image|endswith: \devcon.exe
  - OriginalFileName: DevCon.exe
  selection_vmci_pci:
    CommandLine|contains:
    - 15AD&DEV_0740
    - VMWVMCIHOSTDEV
falsepositives:
- Legitimate VMware administration, Tools installation/uninstallation, or troubleshooting
  driver conflicts.
- Automated scripts in virtualized environments for device cleanup.
id: 85f520e7-6f5e-43ca-874c-222e5bf9c0de
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://learn.microsoft.com/en-us/windows-hardware/drivers/devtest/devcon
- https://communities.vmware.com/t5/VMware-Workstation-Pro/VMCI-driver-issues/td-p/2866060
- https://github.com/search?q=devcon+disable+VMWVMCIHOSTDEV
- https://huntress.com/blog/esxi-vm-escape-exploit
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_devcon_disable_vmci_driver/info.yml
status: experimental
tags:
- attack.persistence
- attack.privilege-escalation
- attack.defense-impairment
- attack.t1543.003
- attack.t1685
title: Devcon Execution Disabling VMware VMCI Device
