author: Christian Burkard (Nextron Systems)
custom:
  wazuh_rule_id: 200123
date: 2021-08-30
description: Detects the pattern of UAC Bypass using IEInstal.exe (UACMe 64)
detection:
  condition: selection
  selection:
    Image|contains: \AppData\Local\Temp\
    Image|endswith: consent.exe
    IntegrityLevel:
    - High
    - System
    - S-1-16-16384
    - S-1-16-12288
    ParentImage|endswith: \ieinstal.exe
falsepositives:
- Unknown
id: 80fc36aa-945e-4181-89f2-2f907ab6775d
level: high
logsource:
  category: process_creation
  product: windows
modified: 2024-12-01
references:
- https://github.com/hfiref0x/UACME
status: test
tags:
- attack.privilege-escalation
- attack.t1548.002
title: UAC Bypass Using IEInstal - Process
