author: Swachchhanda Shrawan Poudel (Nextron Systems)
custom:
  wazuh_rule_id: 200110
date: 2026-01-05
description: 'Detects modifications to User Shell Folders registry values via reg.exe
  or PowerShell, which could indicate persistence attempts.

  Attackers may modify User Shell Folders registry values to point to malicious executables
  or scripts that will be executed during startup.

  This technique is often used to maintain persistence on a compromised system by
  ensuring that malicious payloads are executed automatically.

  '
detection:
  condition: all of selection_*
  selection_cli_action:
    CommandLine|contains:
    - ' add '
    - New-ItemProperty
    - Set-ItemProperty
    - 'si '
  selection_cli_paths_root:
    CommandLine|contains:
    - \Software\Microsoft\Windows\CurrentVersion\Explorer\Shell Folders
    - \Software\Microsoft\Windows\CurrentVersion\Explorer\User Shell Folders
  selection_cli_paths_suffix:
    CommandLine|contains: Startup
  selection_img:
  - Image|endswith:
    - \powershell.exe
    - \pwsh.exe
    - \reg.exe
  - OriginalFileName:
    - powershell.exe
    - pwsh.dll
    - reg.exe
falsepositives:
- Usage of reg.exe or PowerShell to modify User Shell Folders for legitimate purposes;
  but rare.
id: 8f3ab69a-aa22-4943-aa58-e0a52fdf6818
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://www.welivesecurity.com/en/eset-research/muddywater-snakes-riverbank/
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_user_shell_folders_registry_modification/info.yml
related:
- id: 9c226817-8dc9-46c2-a58d-66655aafd7dc
  type: similar
simulation:
- atomic_guid: acfef903-7662-447e-a391-9c91c2f00f7b
  name: Change Startup Folder - HKLM Modify User Shell Folders Common Startup Value
  technique: T1547.001
  type: atomic-red-team
status: experimental
tags:
- attack.persistence
- attack.privilege-escalation
- attack.defense-impairment
- attack.t1547.001
- attack.t1112
title: User Shell Folders Registry Modification via CommandLine
