author: Swachchhanda Shrawan Poudel (Nextron Systems)
custom:
  wazuh_rule_id: 200025
date: 2025-07-30
description: 'Detects the usage of wmic.exe to enumerate or read Windows registry
  via the WMI StdRegProv class read methods (EnumKey, EnumValues, GetStringValue,
  etc.).

  While registry reads are common, attackers may use this technique to perform reconnaissance
  and discover sensitive configuration values, credentials, or installed software.

  The use of WMI as an alternative to standard tools like reg.exe can indicate an
  attempt to evade detection focused on traditional registry query commands.

  '
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains:
    - CheckAccess
    - EnumKey
    - EnumValues
    - GetBinaryValue
    - GetDWORDValue
    - GetExpandedStringValue
    - GetMultiStringValue
    - GetQWORDValue
    - GetSecurityDescriptor
    - GetStringValue
    CommandLine|contains|all:
    - stdregprov
    - call
  selection_img:
  - Image|endswith: \wmic.exe
  - OriginalFileName: wmic.exe
falsepositives:
- Legitimate administrative activity
id: a0e417e2-2fa1-40da-b6d2-e094cd5e1191
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2026-06-19
references:
- https://trustedsec.com/blog/command-line-underdog-wmic-in-action
- https://trustedsec.com/blog/wmi-for-script-kiddies
- https://learn.microsoft.com/en-us/previous-versions/windows/desktop/regprov/stdregprov
related:
- id: c453ab7a-1f5c-4716-a3b4-dea8135fb43a
  type: similar
status: experimental
tags:
- attack.execution
- attack.t1047
- attack.discovery
- attack.t1012
title: Registry Enumeration via WMI Stdregprov
