author: Microsoft (idea), Swachchhanda Shrawan Poudel (Nextron Systems)
custom:
  wazuh_rule_id: 200236
date: 2025-04-21
description: Detects potentially suspicious inline JavaScript execution using Node.js
  with specific keywords in the command line.
detection:
  condition: all of selection_*
  selection_cmd:
    CommandLine|contains|all:
    - http
    - execSync
    - spawn
    - fs
    - path
    - zlib
  selection_img:
  - Image|endswith: \node.exe
  - OriginalFileName: node.exe
  - Product: Node.js
falsepositives:
- Legitimate scripts using Node.js with these modules
id: 8537c866-072e-460d-bfff-aaf39cbd73d3
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://www.microsoft.com/en-us/security/blog/2025/04/15/threat-actors-misuse-node-js-to-deliver-malware-and-other-malicious-payloads/
status: experimental
tags:
- attack.execution
- attack.t1059.007
title: Potentially Suspicious Inline JavaScript Execution via NodeJS Binary
