author: Florian Roth (Nextron Systems)
custom:
  wazuh_rule_id: 200641
date: 2021-04-29
description: Detects requests to exclude files, folders or processes from Antivirus
  scanning using PowerShell cmdlets
detection:
  condition: all of selection*
  selection1:
    CommandLine|contains:
    - 'Add-MpPreference '
    - 'Set-MpPreference '
  selection2:
    CommandLine|contains:
    - ' -ExclusionPath '
    - ' -ExclusionExtension '
    - ' -ExclusionProcess '
    - ' -ExclusionIpAddress '
falsepositives:
- Possible Admin Activity
- Other Cmdlets that may use the same parameters
id: 17769c90-230e-488b-a463-e05c08e9d48f
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022-05-12
references:
- https://learn.microsoft.com/en-us/defender-endpoint/configure-process-opened-file-exclusions-microsoft-defender-antivirus
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
- https://twitter.com/AdamTheAnalyst/status/1483497517119590403
related:
- id: c1344fa2-323b-4d2e-9176-84b4d4821c88
  type: similar
status: test
tags:
- attack.defense-impairment
- attack.t1685
title: Powershell Defender Exclusion
