author: Swachchhanda Shrawan Poudel (Nextron Systems)
custom:
  wazuh_rule_id: 200185
date: 2025-08-29
description: Detects the suspicious use of the Velociraptor DFIR tool to execute other
  tools or download additional payloads, as seen in a campaign where it was abused
  for remote access and to stage further attacks.
detection:
  condition: selection_parent and 1 of selection_child_*
  selection_child_msiexec:
    CommandLine|contains|all:
    - msiexec
    - /i
    - http
  selection_child_powershell:
    CommandLine|contains:
    - 'Invoke-WebRequest '
    - 'IWR '
    - .DownloadFile
    - .DownloadString
    Image|endswith:
    - \powershell.exe
    - \powershell_ise.exe
    - \pwsh.exe
  selection_child_vscode_tunnel:
    CommandLine|contains|all:
    - code.exe
    - tunnel
    - --accept-server-license-terms
  selection_parent:
    ParentImage|endswith: \Velociraptor.exe
falsepositives:
- Legitimate administrators or incident responders might use Velociraptor to execute
  scripts or tools. However, the combination of Velociraptor spawning these specific
  processes with these command lines is suspicious. Tuning may be required to exclude
  known administrative actions or specific scripts.
id: 4bc90587-e6ca-4b41-be0b-ed4d04e4ed0c
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://news.sophos.com/en-us/2025/08/26/velociraptor-incident-response-tool-abused-for-remote-access/
status: experimental
tags:
- attack.command-and-control
- attack.persistence
- attack.t1219
title: Suspicious Velociraptor Child Process
