author: Florian Roth (Nextron Systems), frack113
custom:
  wazuh_rule_id: 200450
date: 2021-11-29
description: Detects the execution of REGSVR32.exe with DLL files masquerading as
  other files
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|endswith:
    - .bin
    - .bmp
    - .cr2
    - .dat
    - .eps
    - .gif
    - .ico
    - .jpeg
    - .jpg
    - .log
    - .nef
    - .orf
    - .png
    - .raw
    - .rtf
    - .sr2
    - .temp
    - .tif
    - .tiff
    - .tmp
    - .txt
  selection_img:
  - Image|endswith: \regsvr32.exe
  - OriginalFileName: REGSVR32.EXE
falsepositives:
- Unlikely
id: 089fc3d2-71e8-4763-a8a5-c97fbb0a403e
level: high
logsource:
  category: process_creation
  product: windows
modified: 2025-08-27
references:
- https://thedfirreport.com/2021/11/29/continuing-the-bazar-ransomware-story/
- https://blog.talosintelligence.com/2021/10/threat-hunting-in-large-datasets-by.html
- https://guides.lib.umich.edu/c.php?g=282942&p=1885348
- https://harfanglab.io/insidethelab/uac-0057-pressure-ukraine-poland/
related:
- id: 8e2b24c9-4add-46a0-b4bb-0057b4e6187d
  type: obsolete
status: test
tags:
- attack.stealth
- attack.t1218.010
title: Regsvr32 DLL Execution With Suspicious File Extension
