author: Julia Fomina, oscd.community
custom:
  wazuh_rule_id: 200390
date: 2020-10-09
description: Detects using Rpcping.exe to send a RPC test connection to the target
  server (-s) and force the NTLM hash to be sent in the process.
detection:
  condition: all of selection_main_* and 1 of selection_cli_*
  selection_cli_ncacn:
    CommandLine|contains: ncacn_np
    CommandLine|contains|windash: -t
  selection_cli_ntlm:
    CommandLine|contains: NTLM
    CommandLine|contains|windash: -u
  selection_main_flag:
    CommandLine|contains|windash: -s
  selection_main_img:
  - Image|endswith: \RpcPing.exe
  - OriginalFileName: \RpcPing.exe
falsepositives:
- Unlikely
id: 93671f99-04eb-4ab4-a161-70d446a84003
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2025-10-31
references:
- https://lolbas-project.github.io/lolbas/Binaries/Rpcping/
- https://twitter.com/vysecurity/status/974806438316072960
- https://twitter.com/vysecurity/status/873181705024266241
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/hh875578(v=ws.11)
status: test
tags:
- attack.credential-access
- attack.t1003
title: Capture Credentials with Rpcping.exe
