author: Florian Roth (Nextron Systems), Modexp, Nasreddine Bencherchali (Nextron Systems),
  Swachchhanda Shrawan Poudel (Nextron Systems)
custom:
  wazuh_rule_id: 200378
date: 2020-02-18
description: Detects a process memory dump via "comsvcs.dll" using rundll32, covering
  multiple different techniques (ordinal, minidump function, etc.)
detection:
  condition: (selection_img and 1 of selection_cli_*) or selection_generic
  selection_cli_1:
    CommandLine|contains:
    - '#-'
    - '#+'
    - '#24'
    - '24 '
    - MiniDump
    - '#65560'
    CommandLine|contains|all:
    - comsvcs
    - full
  selection_generic:
    CommandLine|contains:
    - ' #'
    - ',#'
    - ', #'
    - '"#'
    CommandLine|contains|all:
    - '24'
    - comsvcs
    - full
  selection_img:
  - Image|endswith: \rundll32.exe
  - OriginalFileName: RUNDLL32.EXE
  - CommandLine|contains: rundll32
falsepositives:
- Unlikely
id: 646ea171-dded-4578-8a4d-65e9822892e3
level: high
logsource:
  category: process_creation
  product: windows
modified: 2025-02-23
references:
- https://twitter.com/shantanukhande/status/1229348874298388484
- https://twitter.com/pythonresponder/status/1385064506049630211?s=21
- https://twitter.com/Hexacorn/status/1224848930795552769
- https://modexp.wordpress.com/2019/08/30/minidumpwritedump-via-com-services-dll/
- https://twitter.com/SBousseaden/status/1167417096374050817
- https://twitter.com/Wietze/status/1542107456507203586
- https://github.com/Hackndo/lsassy/blob/14d8f8ae596ecf22b449bfe919829173b8a07635/lsassy/dumpmethod/comsvcs.py
- https://www.youtube.com/watch?v=52tAmVLg1KM&t=2070s
related:
- id: 09e6d5c0-05b8-4ff8-9eeb-043046ec774c
  type: obsolete
status: test
tags:
- attack.credential-access
- attack.stealth
- attack.t1036
- attack.t1003.001
- car.2013-05-009
title: Process Memory Dump Via Comsvcs.DLL
