author: Christian Burkard (Nextron Systems)
custom:
  wazuh_rule_id: 200131
date: 2021-08-31
description: Detects tools such as UACMe used to bypass UAC with computerdefaults.exe
  (UACMe 59)
detection:
  condition: selection and not filter
  filter:
    ParentImage|contains:
    - :\Windows\System32
    - :\Program Files
  selection:
    Image: C:\Windows\System32\ComputerDefaults.exe
    IntegrityLevel:
    - High
    - System
    - S-1-16-16384
    - S-1-16-12288
falsepositives:
- Unknown
id: 3c05e90d-7eba-4324-9972-5d7f711a60a8
level: high
logsource:
  category: process_creation
  product: windows
modified: 2024-12-01
references:
- https://github.com/hfiref0x/UACME
status: test
tags:
- attack.privilege-escalation
- attack.t1548.002
title: UAC Bypass Tools Using ComputerDefaults
