author: Nasreddine Bencherchali (Nextron Systems)
custom:
  wazuh_rule_id: 200160
date: 2022-06-16
description: Detects usage of Sysinternals PsService which can be abused for service
  reconnaissance and tampering
detection:
  condition: selection
  selection:
  - OriginalFileName: psservice.exe
  - Image|endswith:
    - \PsService.exe
    - \PsService64.exe
    - \PsService64a.exe
falsepositives:
- Legitimate use of PsService by an administrator
id: 3371f518-5fe3-4cf6-a14b-2a0ae3fd8a4f
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2026-06-29
references:
- https://learn.microsoft.com/en-us/sysinternals/downloads/psservice
status: test
tags:
- attack.privilege-escalation
- attack.discovery
- attack.persistence
- attack.t1543.003
title: Sysinternals PsService Execution
