author: Swachchhanda Shrawan Poudel (Nextron Systems)
custom:
  wazuh_rule_id: 200273
date: 2025-11-04
description: 'Detects process creation with suspicious whitespace padding followed
  by a ''#'' character, which may indicate ClickFix or FileFix techniques used to
  conceal malicious commands from visual inspection.

  ClickFix and FileFix are social engineering attack techniques where adversaries
  distribute phishing documents or malicious links that deceive users into opening
  the Windows Run dialog box or File Explorer search bar.

  The victims are then instructed to paste commands from their clipboard, which contain
  extensive whitespace padding using various Unicode space characters to push the
  actual malicious command far to the right, effectively hiding it from immediate
  view.

  '
detection:
  condition: all of selection_*
  selection_explorer:
    CommandLine|contains: '#'
    ParentImage|endswith: \explorer.exe
  selection_space_variation:
    CommandLine|contains:
    - "\u2000\u2000\u2000\u2000\u2000\u2000\u2000\u2000\u2000\u2000\u2000\u2000"
    - "\u2001\u2001\u2001\u2001\u2001\u2001\u2001\u2001\u2001\u2001\u2001\u2001"
    - "\u2002\u2002\u2002\u2002\u2002\u2002\u2002\u2002\u2002\u2002\u2002\u2002"
    - "\u2003\u2003\u2003\u2003\u2003\u2003\u2003\u2003\u2003\u2003\u2003\u2003"
    - "\u2004\u2004\u2004\u2004\u2004\u2004\u2004\u2004\u2004\u2004\u2004\u2004"
    - "\u2005\u2005\u2005\u2005\u2005\u2005\u2005\u2005\u2005\u2005\u2005\u2005"
    - "\u2006\u2006\u2006\u2006\u2006\u2006\u2006\u2006\u2006\u2006\u2006\u2006"
    - "\u2007\u2007\u2007\u2007\u2007\u2007\u2007\u2007\u2007\u2007\u2007\u2007"
    - "\u2008\u2008\u2008\u2008\u2008\u2008\u2008\u2008\u2008\u2008\u2008\u2008"
    - "\u2009\u2009\u2009\u2009\u2009\u2009\u2009\u2009\u2009\u2009\u2009\u2009"
    - "\u200A\u200A\u200A\u200A\u200A\u200A\u200A\u200A\u200A\u200A\u200A\u200A"
    - "\_\_\_\_\_\_\_\_\_\_\_\_"
    - '            '
falsepositives:
- Unknown
id: 3ae9974a-eb09-4044-8e70-8980a50c12c8
level: high
logsource:
  category: process_creation
  product: windows
modified: 2025-11-26
references:
- https://expel.com/blog/cache-smuggling-when-a-picture-isnt-a-thousand-words/
- https://mrd0x.com/filefix-clickfix-alternative/
related:
- id: 8f2a5c3d-9e4b-4a7c-8d1f-2e5a6b9c3d7e
  type: similar
- id: 7a1b4c5e-8f3d-4b9a-7c2e-1f4a5b8c6d9e
  type: similar
status: experimental
tags:
- attack.execution
- attack.stealth
- attack.t1204.004
- attack.t1027.010
title: Suspicious Explorer Process with Whitespace Padding - ClickFix/FileFix
