author: '@Kostastsale, Nasreddine Bencherchali (Nextron Systems)'
custom:
  wazuh_rule_id: 200886
date: 2022-10-07
description: 'Detects the execution of SharpWSUS or WSUSpendu, utilities that allow
  for lateral movement through WSUS.

  Windows Server Update Services (WSUS) is a critical component of Windows systems
  and is frequently configured in a way that allows an attacker to circumvent internal
  networking limitations.

  '
detection:
  condition: all of selection_wsuspendu_* or all of selection_sharpwsus_*
  selection_sharpwsus_commands:
    CommandLine|contains:
    - ' approve '
    - ' create '
    - ' check '
    - ' delete '
  selection_sharpwsus_flags:
    CommandLine|contains:
    - ' /payload:'
    - ' /payload='
    - ' /updateid:'
    - ' /updateid='
  selection_wsuspendu_inject:
    CommandLine|contains: ' -Inject '
  selection_wsuspendu_payload:
    CommandLine|contains:
    - ' -PayloadArgs '
    - ' -PayloadFile '
falsepositives:
- Unknown
id: b0ce780f-10bd-496d-9067-066d23dc3aa5
level: high
logsource:
  category: process_creation
  product: windows
modified: 2024-08-23
references:
- https://labs.nettitude.com/blog/introducing-sharpwsus/
- https://github.com/nettitude/SharpWSUS
- https://web.archive.org/web/20210512154016/https://github.com/AlsidOfficial/WSUSpendu/blob/master/WSUSpendu.ps1
status: test
tags:
- attack.execution
- attack.lateral-movement
- attack.t1210
title: HackTool - SharpWSUS/WSUSpendu Execution
