author: Nasreddine Bencherchali (Nextron Systems)
custom:
  wazuh_rule_id: 200836
date: 2022-08-22
description: 'Detects an uncommon parent process of "LINK.EXE".

  Link.EXE in Microsoft incremental linker. Its a utility usually bundled with Visual
  Studio installation.

  Multiple utilities often found in the same folder (editbin.exe, dumpbin.exe, lib.exe,
  etc) have a hardcode call to the "LINK.EXE" binary without checking its validity.

  This would allow an attacker to sideload any binary with the name "link.exe" if
  one of the aforementioned tools get executed from a different location.

  By filtering the known locations of such utilities we can spot uncommon parent process
  of LINK.EXE that might be suspicious or malicious.

  '
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_visual_studio:
    ParentImage|contains:
    - \VC\bin\
    - \VC\Tools\
    ParentImage|startswith:
    - C:\Program Files\Microsoft Visual Studio\
    - C:\Program Files (x86)\Microsoft Visual Studio\
  selection:
    CommandLine|contains: LINK /
    Image|endswith: \link.exe
falsepositives:
- Unknown
id: 6e968eb1-5f05-4dac-94e9-fd0c5cb49fd6
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2024-06-27
references:
- https://twitter.com/0gtweet/status/1560732860935729152
status: test
tags:
- attack.stealth
- attack.t1218
title: Uncommon Link.EXE Parent Process
