author: Teymur Kheirkhabarov (idea), Ryan Plas (rule), oscd.community
custom:
  wazuh_rule_id: 200223
date: 2020-10-05
description: Search for usage of reg or Powershell by non-privileged users to modify
  service configuration in registry
detection:
  condition: all of selection_*
  selection_cli:
  - CommandLine|contains|all:
    - 'reg '
    - add
  - CommandLine|contains:
    - powershell
    - set-itemproperty
    - ' sp '
    - new-itemproperty
  selection_data:
    CommandLine|contains:
    - ImagePath
    - FailureCommand
    - ServiceDLL
    CommandLine|contains|all:
    - ControlSet
    - Services
    IntegrityLevel:
    - Medium
    - S-1-16-8192
falsepositives:
- Unknown
id: 8f02c935-effe-45b3-8fc9-ef8696a9e41d
level: high
logsource:
  category: process_creation
  product: windows
modified: 2024-12-01
references:
- https://image.slidesharecdn.com/kheirkhabarovoffzonefinal-181117201458/95/hunting-for-privilege-escalation-in-windows-environment-20-638.jpg
status: test
tags:
- attack.persistence
- attack.defense-impairment
- attack.t1112
title: Non-privileged Usage of Reg or Powershell
