author: "Norbert Ja\u015Bniewicz (AlphaSOC)"
custom:
  wazuh_rule_id: 200440
date: 2025-05-19
description: 'Detects potential execution of MeshAgent which is a tool used for remote
  access.

  Historical data shows that threat actors rename MeshAgent binary to evade detection.

  Matching command lines with the ''--meshServiceName'' argument can indicate that
  the MeshAgent is being used for remote access.

  '
detection:
  condition: selection
  selection:
    CommandLine|contains: --meshServiceName
falsepositives:
- Environments that legitimately use MeshAgent
id: 2fbbe9ff-0afc-470b-bdc0-592198339968
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://www.huntress.com/blog/know-thy-enemy-a-novel-november-case-on-persistent-remote-access
- https://thecyberexpress.com/ukraine-hit-by-meshagent-malware-campaign/
- https://wazuh.com/blog/how-to-detect-meshagent-with-wazuh/
- https://www.security.com/threat-intelligence/medusa-ransomware-attacks
related:
- id: 22c45af6-f590-4d44-bab3-b5b2d2a2b6d9
  type: similar
status: experimental
tags:
- attack.command-and-control
- attack.t1219.002
title: Remote Access Tool - Potential MeshAgent Execution - Windows
