author: '@Kostastsale, TheDFIRReport'
custom:
  wazuh_rule_id: 200459
date: 2022-05-14
description: 'Detects changes to the registry key "HKLM\Software\Microsoft\Windows
  NT\CurrentVersion\Winlogon\SpecialAccounts\Userlist" where the value is set to "0"
  in order to hide user account from being listed on the logon screen.

  '
detection:
  condition: selection
  selection:
    CommandLine|contains|all:
    - \SOFTWARE\Microsoft\Windows NT\CurrentVersion\Winlogon\SpecialAccounts\UserList
    - add
    - /v
    - /d 0
    Image|endswith: \reg.exe
falsepositives:
- System administrator activities
id: 9ec9fb1b-e059-4489-9642-f270c207923d
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2024-08-23
references:
- https://thedfirreport.com/2024/01/29/buzzing-on-christmas-eve-trigona-ransomware-in-3-hours/
- https://thedfirreport.com/2024/04/01/from-onenote-to-ransomnote-an-ice-cold-intrusion/
- https://thedfirreport.com/2024/04/29/from-icedid-to-dagon-locker-ransomware-in-29-days/
- https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_registry_special_accounts_hide_user/info.yml
related:
- id: f8aebc67-a56d-4ec9-9fbe-7b0e8b7b4efd
  type: similar
status: test
tags:
- attack.stealth
- attack.t1564.002
title: Hiding User Account Via SpecialAccounts Registry Key - CommandLine
