author: Nasreddine Bencherchali (Nextron Systems)
custom:
  wazuh_rule_id: 200258
date: 2022-10-21
description: 'Detects suspicious child processes of electron apps (teams, discord,
  slack, etc.). This could be a potential sign of ".asar" file tampering (See reference
  section for more information) or binary execution proxy through specific CLI arguments
  (see related rule)

  '
detection:
  condition: selection_parent and 1 of selection_child_* and not 1 of filter_optional_*
  filter_optional_discord:
    CommandLine|contains: \NVSMI\nvidia-smi.exe
    Image|endswith: \cmd.exe
    ParentImage|endswith: \Discord.exe
  selection_child_image:
    Image|endswith:
    - \cmd.exe
    - \cscript.exe
    - \mshta.exe
    - \powershell.exe
    - \pwsh.exe
    - \regsvr32.exe
    - \whoami.exe
    - \wscript.exe
  selection_child_paths:
    Image|contains:
    - :\ProgramData\
    - :\Temp\
    - \AppData\Local\Temp\
    - \Users\Public\
    - \Windows\Temp\
  selection_parent:
    ParentImage|endswith:
    - \chrome.exe
    - \discord.exe
    - \GitHubDesktop.exe
    - \keybase.exe
    - \msedge.exe
    - \msedgewebview2.exe
    - \msteams.exe
    - \slack.exe
    - \teams.exe
falsepositives:
- Unknown
id: f26eb764-fd89-464b-85e2-dc4a8e6e77b8
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2024-07-12
references:
- https://taggart-tech.com/quasar-electron/
- https://github.com/mttaggart/quasar
- https://positive.security/blog/ms-officecmd-rce
- https://lolbas-project.github.io/lolbas/Binaries/Msedge/
- https://lolbas-project.github.io/lolbas/Binaries/Teams/
- https://lolbas-project.github.io/lolbas/Binaries/msedgewebview2/
- https://medium.com/@MalFuzzer/one-electron-to-rule-them-all-dc2e9b263daf
related:
- id: 378a05d8-963c-46c9-bcce-13c7657eac99
  type: similar
status: test
tags:
- attack.execution
title: Suspicious Electron Application Child Processes
