author: Swachchhanda Shrawan Poudel (Nextron Systems)
custom:
  wazuh_rule_id: 201068
date: 2025-05-24
description: 'Detects the creation of a dMSASvc account using the New-ADServiceAccount
  cmdlet in certain OUs.

  The fact that the Cmdlet is used to create a dMSASvc account in a specific OU is
  highly suspicious.

  It is a pattern trying to exploit the BadSuccessor privilege escalation vulnerability
  in Windows Server 2025.

  On top of that, if the user that is creating the dMSASvc account is not a legitimate
  administrator or does not have the necessary permissions,

  it is a strong signal of an attempted or successful abuse of the BaDSuccessor vulnerability
  for privilege escalation within the Windows Server 2025 Active Directory environment.

  '
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains|all:
    - New-ADServiceAccount
    - -CreateDelegatedServiceAccount
    - -path
  selection_img:
  - Image|endswith:
    - \powershell.exe
    - \pwsh.exe
    - \powershell_ise.exe
  - OriginalFileName:
    - powershell.exe
    - pwsh.dll
    - powershell_ise.exe
falsepositives:
- Unknown
id: 0ea8db81-2ff6-4525-9448-33bbe7effc13
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://www.akamai.com/blog/security-research/abusing-bad-successor-for-privilege-escalation-in-active-directory
related:
- id: e15bc294-ae2a-45ad-b7d6-637b33868bde
  type: similar
- id: 02122374-b74e-495c-b285-9e4da973f3d6
  type: similar
status: experimental
tags:
- attack.privilege-escalation
- attack.initial-access
- attack.persistence
- attack.stealth
- attack.t1078.002
- attack.t1098
title: New DMSA Service Account Created in Specific OUs
