author: Nasreddine Bencherchali (Nextron Systems)
custom:
  wazuh_rule_id: 201123
date: 2023-02-15
description: Detects the execution of certutil with certain flags that allow the utility
  to download files from direct IPs.
detection:
  condition: all of selection_* and not 1 of filter_main_*
  filter_main_seven_zip:
    CommandLine|contains: ://7-
  selection_flags:
    CommandLine|contains:
    - 'urlcache '
    - 'verifyctl '
    - 'URL '
  selection_http:
    CommandLine|contains:
    - ://1
    - ://2
    - ://3
    - ://4
    - ://5
    - ://6
    - ://7
    - ://8
    - ://9
  selection_img:
  - Image|endswith: \certutil.exe
  - OriginalFileName: CertUtil.exe
falsepositives:
- Unknown
id: 13e6fe51-d478-4c7e-b0f2-6da9b400a829
level: high
logsource:
  category: process_creation
  product: windows
modified: 2025-12-01
references:
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/certutil
- https://forensicitguy.github.io/agenttesla-vba-certutil-download/
- https://news.sophos.com/en-us/2021/04/13/compromised-exchange-server-hosting-cryptojacker-targeting-other-exchange-servers/
- https://twitter.com/egre55/status/1087685529016193025
- https://lolbas-project.github.io/lolbas/Binaries/Certutil/
- https://twitter.com/_JohnHammond/status/1708910264261980634
- https://www.hexacorn.com/blog/2020/08/23/certutil-one-more-gui-lolbin
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_certutil_download_direct_ip/info.yml
related:
- id: 19b08b1c-861d-4e75-a1ef-ea0c1baf202b
  type: similar
- id: 42a5f1e7-9603-4f6d-97ae-3f37d130d794
  type: similar
status: test
tags:
- attack.stealth
- attack.t1027
- attack.command-and-control
- attack.t1105
title: Suspicious File Downloaded From Direct IP Via Certutil.EXE
