author: Florian Roth (Nextron Systems)
custom:
  wazuh_rule_id: 200393
date: 2022-09-06
description: Detects the use of a renamed SysInternals Sdelete, which is something
  an administrator shouldn't do (the renaming)
detection:
  condition: selection and not filter
  filter:
    Image|endswith:
    - \sdelete.exe
    - \sdelete64.exe
    - \sdelete64a.exe
  selection:
    OriginalFileName: sdelete.exe
falsepositives:
- System administrator usage
id: c1d867fe-8d95-4487-aab4-e53f2d339f90
level: high
logsource:
  category: process_creation
  product: windows
modified: 2026-06-29
references:
- https://learn.microsoft.com/en-us/sysinternals/downloads/sdelete
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1485/T1485.md
status: test
tags:
- attack.impact
- attack.t1485
title: Renamed Sysinternals Sdelete Execution
