author: Ayush Anand (Securityinbits)
custom:
  wazuh_rule_id: 200573
date: 2026-04-28
description: 'Detects the abuse of the Print.exe utility for credential harvesting
  which involves using Print.Exe to copy sensitive files such as ntds.dit, SAM, SECURITY,
  or SYSTEM from the Windows directory in order to extract credentials, locally or
  remotely.

  '
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains:
    - \config\SAM
    - \config\SECURITY
    - \config\SYSTEM
    - \windows\ntds\ntds.dit
    CommandLine|contains|windash: /D
  selection_img:
  - Image|endswith: \print.exe
  - OriginalFileName: Print.EXE
falsepositives:
- Unlikely
id: 2fcda7e2-8c57-4904-86ac-37fc3157e09d
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://www.microsoft.com/en-us/security/blog/2026/02/06/active-exploitation-solarwinds-web-help-desk/
- https://www.huntress.com/blog/credential-theft-expanding-your-reach-pt-2
- https://lolbas-project.github.io/lolbas/Binaries/Print/
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_print_dump_sensitive_files/info.yml
status: test
tags:
- attack.credential-access
- attack.stealth
- attack.t1003.003
- attack.t1003.002
- attack.t1218
title: Sensitive File Dump Via Print.EXE
