author: Florian Roth (Nextron Systems), Jonhnathan Ribeiro, oscd.community, Nasreddine
  Bencherchali (Nextron Systems)
custom:
  wazuh_rule_id: 201121
date: 2019-02-24
description: Detects the execution of certutil with the "encode" flag to encode a
  file to base64. This can be abused by threat actors and attackers for data exfiltration
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains|windash: -encode
  selection_img:
  - Image|endswith: \certutil.exe
  - OriginalFileName: CertUtil.exe
falsepositives:
- As this is a general purpose rule, legitimate usage of the encode functionality
  will trigger some false positives. Apply additional filters accordingly
id: e62a9f0c-ca1e-46b2-85d5-a6da77f86d1a
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2024-03-05
references:
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/certutil
- https://unit42.paloaltonetworks.com/new-babyshark-malware-targets-u-s-national-security-think-tanks/
- https://lolbas-project.github.io/lolbas/Binaries/Certutil/
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_certutil_encode/info.yml
status: test
tags:
- attack.stealth
- attack.t1027
title: File Encoded To Base64 Via Certutil.EXE
