author: Beyu Denis, oscd.community
custom:
  wazuh_rule_id: 200820
date: 2020-10-18
description: Detects file execution using the msdeploy.exe lolbin
detection:
  condition: selection
  selection:
    CommandLine|contains|all:
    - verb:sync
    - -source:RunCommand
    - -dest:runCommand
    Image|endswith: \msdeploy.exe
falsepositives:
- System administrator Usage
id: 646bc99f-6682-4b47-a73a-17b1b64c9d34
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021-11-27
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Msdeploy/
- https://twitter.com/pabraeken/status/995837734379032576
- https://twitter.com/pabraeken/status/999090532839313408
status: test
tags:
- attack.stealth
- attack.t1218
title: Execute Files with Msdeploy.exe
