author: Daniil Yugoslavskiy, oscd.community
custom:
  wazuh_rule_id: 201028
date: 2019-10-24
description: Well-known DNS Exfiltration tools execution
detection:
  condition: selection
  selection:
  - Image|endswith: \iodine.exe
  - Image|contains: \dnscat2
falsepositives:
- Unlikely
id: 98a96a5a-64a0-4c42-92c5-489da3866cb0
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021-11-27
references:
- https://github.com/iagox86/dnscat2
- https://github.com/yarrick/iodine
status: test
tags:
- attack.exfiltration
- attack.t1048.001
- attack.command-and-control
- attack.t1071.004
- attack.t1132.001
title: DNS Exfiltration and Tunneling Tools Execution
