author: Nasreddine Bencherchali (Nextron Systems)
custom:
  wazuh_rule_id: 200614
date: 2023-01-31
description: Detects usage of the "Add-AppxPackage" or it's alias "Add-AppPackage"
  to install unsigned AppX packages
detection:
  condition: all of selection_*
  selection_cmdlet:
    CommandLine|contains:
    - 'Add-AppPackage '
    - 'Add-AppxPackage '
  selection_flag:
    CommandLine|contains: ' -AllowUnsigned'
  selection_img:
  - Image|endswith:
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - PowerShell.EXE
    - pwsh.dll
falsepositives:
- Installation of unsigned packages for testing purposes
id: 37651c2a-42cd-4a69-ae0d-22a4349aa04a
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://learn.microsoft.com/en-us/windows/msix/package/unsigned-package
- https://twitter.com/WindowsDocs/status/1620078135080325122
related:
- id: 975b2262-9a49-439d-92a6-0709cccdf0b2
  type: similar
- id: 9a025188-6f2d-42f8-bb2f-d3a83d24a5af
  type: similar
status: test
tags:
- attack.persistence
- attack.stealth
title: Unsigned AppX Installation Attempt Using Add-AppxPackage
