author: Florian Roth (Nextron Systems)
custom:
  wazuh_rule_id: 200888
date: 2022-08-20
description: Detects the use of SharpUp, a tool for local privilege escalation
detection:
  condition: selection
  selection:
  - Image|endswith: \SharpUp.exe
  - Description: SharpUp
  - CommandLine|contains:
    - HijackablePaths
    - UnquotedServicePath
    - ProcessDLLHijack
    - ModifiableServiceBinaries
    - ModifiableScheduledTask
    - DomainGPPPassword
    - CachedGPPPassword
falsepositives:
- Unknown
id: c484e533-ee16-4a93-b6ac-f0ea4868b2f1
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2023-02-13
references:
- https://github.com/GhostPack/SharpUp
status: test
tags:
- attack.persistence
- attack.privilege-escalation
- attack.discovery
- attack.execution
- attack.stealth
- attack.t1615
- attack.t1569.002
- attack.t1574.005
title: HackTool - SharpUp PrivEsc Tool Execution
