author: Sreeman, Florian Roth (Nextron Systems)
custom:
  wazuh_rule_id: 201141
date: 2022-01-04
description: Detects execution of chromium based browser in headless mode using the
  "dump-dom" command line to download files
detection:
  condition: selection and not 1 of filter_optional_*
  filter_optional_edge_1:
    CommandLine|contains: --headless --disable-gpu --disable-extensions --disable-plugins
      --mute-audio --no-first-run --incognito --aggressive-cache-discard --dump-dom
    Image|endswith:
    - \msedge.exe
    - \msedgewebview2.exe
    - \MicrosoftEdge.exe
    Image|startswith:
    - C:\Program Files (x86)\Microsoft\Edge\Application\
    - C:\Program Files (x86)\Microsoft\EdgeCore\
    - C:\Program Files (x86)\Microsoft\EdgeWebView\
    - C:\Program Files\Microsoft\Edge\Application\
    - C:\Program Files\Microsoft\EdgeCore\
    - C:\Program Files\Microsoft\EdgeWebView\
    - C:\Program Files\WindowsApps\Microsoft.MicrosoftEdge
  filter_optional_edge_2:
    CommandLine|contains: --headless --disable-gpu --disable-extensions --disable-plugins
      --mute-audio --no-first-run --incognito --aggressive-cache-discard --dump-dom
    Image|contains:
    - \AppData\Local\Microsoft\WindowsApps\
    - \Windows\SystemApps\Microsoft.MicrosoftEdge
    Image|endswith:
    - \msedge.exe
    - \MicrosoftEdge.exe
  selection:
    CommandLine|contains|all:
    - --headless
    - dump-dom
    - http
    Image|endswith:
    - \brave.exe
    - \chrome.exe
    - \msedge.exe
    - \opera.exe
    - \vivaldi.exe
falsepositives:
- Unknown
id: 0e8cfe08-02c9-4815-a2f8-0d157b7ed33e
level: high
logsource:
  category: process_creation
  product: windows
modified: 2025-10-07
references:
- https://twitter.com/mrd0x/status/1478234484881436672?s=12
- https://www.trendmicro.com/en_us/research/23/e/managed-xdr-investigation-of-ducktail-in-trend-micro-vision-one.html
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_browsers_chromium_headless_file_download/info.yml
related:
- id: ef9dcfed-690c-4c5d-a9d1-482cd422225c
  type: derived
status: test
tags:
- attack.command-and-control
- attack.stealth
- attack.t1105
- attack.t1564.003
title: File Download with Headless Browser
