author: Nasreddine Bencherchali (Nextron Systems)
custom:
  wazuh_rule_id: 200616
date: 2022-09-09
description: Adversaries may install a root certificate on a compromised system to
  avoid warnings when connecting to adversary controlled web servers.
detection:
  condition: selection
  selection:
    CommandLine|contains:
    - \AppData\Local\Temp\
    - :\Windows\TEMP\
    - \Desktop\
    - \Downloads\
    - \Perflogs\
    - :\Users\Public\
    CommandLine|contains|all:
    - Import-Certificate
    - ' -FilePath '
    - Cert:\LocalMachine\Root
falsepositives:
- Unlikely
id: 5f6a601c-2ecb-498b-9c33-660362323afa
level: high
logsource:
  category: process_creation
  product: windows
modified: 2023-01-16
references:
- https://www.microsoft.com/security/blog/2022/09/07/profiling-dev-0270-phosphorus-ransomware-operations/
- https://learn.microsoft.com/en-us/powershell/module/pki/import-certificate?view=windowsserver2022-ps
status: test
tags:
- attack.defense-impairment
- attack.t1553.004
title: Root Certificate Installed From Susp Locations
