author: Liran Ravich
custom:
  wazuh_rule_id: 200049
date: 2025-10-22
description: 'Detects a child process spawned by ''winrshost.exe'', which suggests
  remote command execution through Windows Remote Shell (WinRs) and may indicate potential
  lateral movement activity.

  '
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_conhost:
    Image: C:\Windows\System32\conhost.exe
  selection:
    ParentImage|endswith: \winrshost.exe
falsepositives:
- Legitimate use of WinRM within the organization
id: 79df3f68-dccb-48e9-9171-b75cbc37c51d
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://cardinalops.com/blog/living-off-winrm-abusing-complexity-in-remote-management/
- https://www.ired.team/offensive-security/lateral-movement/winrs-for-lateral-movement
status: experimental
tags:
- attack.lateral-movement
- attack.t1021.006
title: Potential Lateral Movement via Windows Remote Shell
