author: Nasreddine Bencherchali (Nextron Systems)
custom:
  wazuh_rule_id: 200801
date: 2022-11-10
description: Detects the usage of the "sftp.exe" binary as a LOLBIN by abusing the
  "-D" flag
detection:
  condition: selection
  selection:
    CommandLine|contains:
    - ' -D ..'
    - ' -D C:\'
    Image|endswith: \sftp.exe
falsepositives:
- Unknown
id: a85ffc3a-e8fd-4040-93bf-78aff284d801
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/LOLBAS-Project/LOLBAS/pull/264
status: test
tags:
- attack.execution
- attack.stealth
- attack.t1218
title: Use Of The SFTP.EXE Binary As A LOLBIN
