author: "Ensar \u015Eamil, @sblmsrsn, @oscd_initiative, Nasreddine Bencherchali (Nextron\
  \ Systems)"
custom:
  wazuh_rule_id: 200000
date: 2020-10-07
description: 'Detects the execution of Xwizard tool with the "RunWizard" flag and
  a GUID like argument.

  This utility can be abused in order to run custom COM object created in the registry.

  '
detection:
  condition: selection
  selection:
    CommandLine: RunWizard
    CommandLine|re: \{[a-fA-F0-9]{8}-[a-fA-F0-9]{4}-[a-fA-F0-9]{4}-[a-fA-F0-9]{4}-[a-fA-F0-9]{12}\}
falsepositives:
- Unknown
id: 53d4bb30-3f36-4e8a-b078-69d36c4a79ff
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2024-08-15
references:
- https://lolbas-project.github.io/lolbas/Binaries/Xwizard/
- https://www.elastic.co/guide/en/security/current/execution-of-com-object-via-xwizard.html
- https://www.hexacorn.com/blog/2017/07/31/the-wizard-of-x-oppa-plugx-style/
status: test
tags:
- attack.stealth
- attack.t1218
title: COM Object Execution via Xwizard.EXE
