author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
custom:
  wazuh_rule_id: 200164
date: 2023-02-28
description: Detects potential psexec command that initiate execution on a remote
  systems via common commandline flags used by the utility
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_localhost:
    CommandLine|contains:
    - \\\\localhost
    - \\\\127.
  selection:
    CommandLine|contains|all:
    - accepteula
    - ' -u '
    - ' -p '
    - ' \\\\'
falsepositives:
- Unknown
id: ea011323-7045-460b-b2d7-0f7442ea6b38
level: high
logsource:
  category: process_creation
  product: windows
modified: 2025-09-01
references:
- https://learn.microsoft.com/en-us/sysinternals/downloads/psexec
- https://www.poweradmin.com/paexec/
- https://www.fireeye.com/blog/threat-research/2020/10/kegtap-and-singlemalt-with-a-ransomware-chaser.html
status: test
tags:
- attack.resource-development
- attack.t1587.001
title: Potential PsExec Remote Execution
