author: Florian Roth (Nextron Systems), Swachchhanda Shrawan Poudel (Nextron Systems)
custom:
  wazuh_rule_id: 200785
date: 2022-03-22
description: 'Detects modification of LSA PPL protection settings via CommandLine.

  It may indicate an attempt to disable protection and enable credential dumping tools
  to access LSASS process memory.

  '
detection:
  condition: all of selection_*
  selection_cli_action:
    CommandLine|contains:
    - Set-ItemProperty
    - New-ItemProperty
    - ' add '
    CommandLine|contains|all:
    - ControlSet
    - \Control\Lsa
  selection_img:
  - Image|endswith:
    - \reg.exe
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - reg.exe
    - powershell.exe
    - pwsh.dll
  selection_key:
    CommandLine|contains:
    - IsPplAutoEnabled
    - RunAsPPL
    - RunAsPPLBoot
falsepositives:
- Unlikely
id: 8c0eca51-0f88-4db2-9183-fdfb10c703f9
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2026-03-13
references:
- https://thedfirreport.com/2022/03/21/apt35-automates-initial-access-using-proxyshell/
- https://github.com/shoober420/windows11-scripts/blob/38d83331738cd713ccb42f2c4557d17a27aefd98/Windows11Tweaks.bat#L1825
status: test
tags:
- attack.defense-impairment
- attack.t1689
title: LSA PPL Protection Setting Modification via CommandLine
