author: Swachchhanda Shrawan Poudel (Nextron Systems)
custom:
  wazuh_rule_id: 200009
date: 2025-10-10
description: 'Detects installation of Kali Linux distribution through Windows Subsystem
  for Linux (WSL).

  Attackers may use Kali Linux WSL to leverage its penetration testing tools and capabilities
  for malicious purposes.

  '
detection:
  condition: all of selection_wsl_*
  selection_wsl_img:
  - Image|endswith: \wsl.exe
  - OriginalFileName: wsl
  selection_wsl_install:
    CommandLine|contains:
    - ' --install '
    - ' -i '
  selection_wsl_kali:
    CommandLine|contains: kali
falsepositives:
- Legitimate installation or usage of Kali Linux WSL by administrators or security
  teams
id: eca8ae39-5c3c-4321-b538-9e64fe25822e
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://medium.com/@redfanatic7/running-kali-linux-on-windows-51ad95166e6e
- https://learn.microsoft.com/en-us/windows/wsl/install
status: experimental
tags:
- attack.execution
- attack.t1059
title: Installation of WSL Kali-Linux
