author: frack113
custom:
  wazuh_rule_id: 201101
date: 2021-12-13
description: 'Detects usage of the "dir" command part of Windows CMD with the "/S"
  command line flag in order to enumerate files in a specified directory and all subdirectories.

  '
detection:
  condition: all of selection_* and not 1 of filter_main_*
  filter_main_rmdir:
    CommandLine|contains: rmdir
  selection_cli:
    CommandLine|contains: 'dir '
    CommandLine|contains|windash: -s
  selection_cmd:
  - Image|endswith: \cmd.exe
  - OriginalFileName: Cmd.Exe
falsepositives:
- Likely
id: 7c9340a9-e2ee-4e43-94c5-c54ebbea1006
level: low
logsource:
  category: process_creation
  product: windows
modified: 2026-05-18
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1217/T1217.md
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_cmd_dir_execution/info.yml
simulation:
- atomic_guid: 727dbcdb-e495-4ab1-a6c4-80c7f77aef85
  name: List Internet Explorer Bookmarks using the command prompt
  technique: T1217
  type: atomic-red-team
status: test
tags:
- attack.discovery
- attack.t1217
title: File And SubFolder Enumeration Via Dir Command
