author: Nasreddine Bencherchali (Nextron Systems), memory-shards
custom:
  wazuh_rule_id: 201173
date: 2022-12-24
description: Detects execution of the AgentExecutor.exe binary. Which can be abused
  as a LOLBIN to execute powershell scripts with the ExecutionPolicy "Bypass" or any
  binary named "powershell.exe" located in the path provided by 6th positional argument
detection:
  condition: all of selection_* and not 1 of filter_main_*
  filter_main_intune:
    ParentImage|endswith: \Microsoft.Management.Services.IntuneWindowsAgent.exe
  filter_main_pwsh:
    CommandLine|contains:
    - C:\Windows\System32\WindowsPowerShell\v1.0\
    - C:\Windows\SysWOW64\WindowsPowerShell\v1.0\
  selection_cli:
    CommandLine|contains:
    - ' -powershell'
    - ' -remediationScript'
  selection_img:
  - Image|endswith: \AgentExecutor.exe
  - OriginalFileName: AgentExecutor.exe
falsepositives:
- Unknown
id: c0b40568-b1e9-4b03-8d6c-b096da6da9ab
level: high
logsource:
  category: process_creation
  product: windows
modified: 2024-08-07
references:
- https://twitter.com/lefterispan/status/1286259016436514816
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Agentexecutor/
- https://learn.microsoft.com/en-us/mem/intune/apps/intune-management-extension
- https://twitter.com/jseerden/status/1247985304667066373/photo/1
related:
- id: 7efd2c8d-8b18-45b7-947d-adfe9ed04f61
  type: similar
status: test
tags:
- attack.stealth
- attack.t1218
title: Suspicious AgentExecutor PowerShell Execution
