author: Rory Duncan
custom:
  wazuh_rule_id: 200332
date: 2025-07-14
description: Detects the creation of new scheduled tasks via commandline, using Schtasks.exe.
  This rule detects tasks creating that call OpenSSH, which may indicate the creation
  of reverse SSH tunnel to the attacker's server.
detection:
  condition: selection_img and 1 of selection_cli_*
  selection_cli_ssh:
    CommandLine|contains|all:
    - ' /create '
    - ssh.exe
    - -i
  selection_cli_sshd:
    CommandLine|contains|all:
    - ' /create '
    - sshd.exe
    - -f
  selection_img:
  - Image|endswith: \schtasks.exe
  - OriginalFileName: schtasks.exe
falsepositives:
- Unknown
id: 2daa93a0-a5fb-41c5-8cd8-3c11294bfd1f
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://thedfirreport.com/2023/10/30/netsupport-intrusion-results-in-domain-compromise/
- https://www.kroll.com/en/insights/publications/cyber/cactus-ransomware-prickly-new-variant-evades-detection
status: experimental
tags:
- attack.privilege-escalation
- attack.persistence
- attack.execution
- attack.t1053.005
- attack.command-and-control
title: Potential SSH Tunnel Persistence Install Using A Scheduled Task
