author: Michael Haag, Swachchhanda Shrawan Poudel (Nextron Systems)
custom:
  wazuh_rule_id: 200753
date: 2025-11-03
description: 'Detects execution of Advanced Installer MSIX Package Support Framework
  (PSF) components, specifically AI_STUBS executables with original filename ''popupwrapper.exe''.

  This activity may indicate malicious MSIX packages build with Advanced Installer
  leveraging the Package Support Framework to bypass application control restrictions.

  '
detection:
  condition: selection
  selection:
    Image|endswith:
    - \AI_STUBS\AiStubX64Elevated.exe
    - \AI_STUBS\AiStubX86Elevated.exe
    - \AI_STUBS\AiStubX64.exe
    - \AI_STUBS\AiStubX86.exe
    OriginalFileName: popupwrapper.exe
falsepositives:
- Legitimate applications packaged with Advanced Installer using Package Support Framework
id: af5732ed-764e-489d-826d-0447c8b36242
level: low
logsource:
  category: process_creation
  product: windows
references:
- https://redcanary.com/blog/threat-intelligence/msix-installers/
- https://redcanary.com/threat-detection-report/techniques/installer-packages/
- https://learn.microsoft.com/en-us/windows/msix/package/package-support-framework
- https://www.splunk.com/en_us/blog/security/msix-weaponization-threat-detection-splunk.html
status: experimental
tags:
- attack.execution
- attack.stealth
- attack.defense-impairment
- attack.t1218
- attack.t1553.005
- attack.t1204.002
title: Windows MSIX Package Support Framework AI_STUBS Execution
