author: frack113
custom:
  wazuh_rule_id: 200311
date: 2024-12-01
description: 'Detects the execution of "Setup16.EXE" and old installation utility
  with a custom ".lst" file.

  These ".lst" file can contain references to external program that "Setup16.EXE"
  will execute.

  Attackers and adversaries might leverage this as a living of the land utility.

  '
detection:
  condition: selection and not 1 of filter_optional_*
  filter_optional_valid_path:
    Image|startswith: C:\~MSSETUP.T\
  selection:
    ParentCommandLine|contains: ' -m '
    ParentImage: C:\Windows\SysWOW64\setup16.exe
falsepositives:
- On modern Windows system, the "Setup16" utility is practically never used, hence
  false positive should be very rare.
id: 99c8be4f-3087-4f9f-9c24-8c7e257b442e
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://www.hexacorn.com/blog/2024/10/12/the-sweet16-the-oldbin-lolbin-called-setup16-exe/
status: test
tags:
- attack.privilege-escalation
- attack.persistence
- attack.execution
- attack.stealth
- attack.t1574.005
title: Setup16.EXE Execution With Custom .Lst File
