author: Nasreddine Bencherchali (Nextron Systems)
custom:
  wazuh_rule_id: 200326
date: 2022-08-31
description: Detects scheduled task creations or modification to be run with high
  privileges on a suspicious schedule type
detection:
  condition: all of selection_*
  selection_img:
  - Image|endswith: \schtasks.exe
  - OriginalFileName: schtasks.exe
  selection_privs:
    CommandLine|contains:
    - NT AUT
    - ' SYSTEM'
    - HIGHEST
  selection_time:
    CommandLine|contains:
    - ' ONLOGON '
    - ' ONSTART '
    - ' ONCE '
    - ' ONIDLE '
falsepositives:
- Some installers were seen using this method of creation unfortunately. Filter them
  in your environment
id: 7a02e22e-b885-4404-b38b-1ddc7e65258a
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks-change
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks-create
related:
- id: 24c8392b-aa3c-46b7-a545-43f71657fe98
  type: similar
status: test
tags:
- attack.privilege-escalation
- attack.persistence
- attack.execution
- attack.t1053.005
title: Suspicious Schtasks Schedule Type With High Privileges
