author: Nasreddine Bencherchali (Nextron Systems)
custom:
  wazuh_rule_id: 201054
date: 2023-07-27
description: Detects execution of "curl.exe" with the "insecure" flag over proxy or
  DOH.
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains:
    - --doh-insecure
    - --proxy-insecure
  selection_img:
  - Image|endswith: \curl.exe
  - OriginalFileName: curl.exe
falsepositives:
- Access to badly maintained internal or development systems
id: 2c1486f5-02e8-4f86-9099-b97f2da4ed77
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://curl.se/docs/manpage.html
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_curl_insecure_proxy_or_doh/info.yml
status: test
tags:
- attack.execution
title: Insecure Proxy/DOH Transfer Via Curl.EXE
