author: lazarg
custom:
  wazuh_rule_id: 201036
date: 2025-06-12
description: Detects attempts to query system information directly from the Windows
  Registry.
detection:
  condition: 1 of selection_cmd_* and selection_keys
  selection_cmd_powershell:
    CommandLine|contains:
    - Get-ItemPropertyValue
    - gpv
    Image|endswith:
    - \powershell.exe
    - \pwsh.exe
  selection_cmd_reg:
    CommandLine|contains: query
    CommandLine|contains|windash: -v
    Image|endswith: \reg.exe
  selection_keys:
    CommandLine|contains:
    - \SOFTWARE\Microsoft\Windows Defender
    - \SOFTWARE\Microsoft\Windows NT\CurrentVersion
    - \SOFTWARE\Microsoft\Windows\CurrentVersion\Uninstall
    - \SYSTEM\CurrentControlSet\Control\TimeZoneInformation
    - \SYSTEM\CurrentControlSet\Services
falsepositives:
- Unlikely
id: 0022869c-49f7-4ff2-ba03-85ac42ddac58
level: low
logsource:
  category: process_creation
  product: windows
modified: 2025-10-25
references:
- https://cert.gov.ua/article/6277849
- https://github.com/redcanaryco/atomic-red-team/blob/75fa21076dcefa348a7521403cdd6bfc4e88623c/atomics/T1082/T1082.md
- https://github.com/redcanaryco/atomic-red-team/blob/75fa21076dcefa348a7521403cdd6bfc4e88623c/atomics/T1124/T1124.md
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_discovery_via_reg_queries/info.yml
simulation:
- atomic_guid: 66703791-c902-4560-8770-42b8a91f7667
  name: System Information Discovery
  technique: T1010
  type: atomic-red-team
- atomic_guid: be3b5fe3-a575-4fb8-83f6-ad4a68dd5ce7
  name: Discover OS Product Name via Registry
  technique: T1082
  type: atomic-red-team
- atomic_guid: acfcd709-0013-4f1e-b9ee-bc1e7bafaaec
  name: Discover OS Build Number via Registry
  technique: T1082
  type: atomic-red-team
status: experimental
tags:
- attack.discovery
- attack.t1082
title: System Information Discovery via Registry Queries
